RETURN comment.id as commentid, msg.id as msgid, tag.id as tagid, relatedTag.id as relatedTagid
**********
select Message0.content, Tag1.name, Tag0.name, Comment0.content
from neo4j,Message Message0, Tag Tag0, Tag Tag1, Comment Comment0
where Tag0.name = $param and Tag1.name = $param and neo4j.msgid = Message0.id and neo4j.relatedTagid = Tag0.id and neo4j.tagid = Tag1.id and neo4j.commentid = Comment0.id
##########
MATCH (tc:TagClass)<-[:HAS_TYPE]-(tag:Tag)<-[:HAS_TAG]-(post:Post2)-[:HAS_CREATOR]->(person:Person1)

RETURN tag.id as tagid, person.id as personid, post.id as postid, tc.id as tcid
**********
select Tag0.name, Person0.lastName, Post0.content, Person0.firstName
from neo4j,TagClass TagClass0, Person Person0, Post Post0, Tag Tag0
where TagClass0.name = $param and Person0.gender = $param and neo4j.tcid = TagClass0.id and neo4j.personid = Person0.id and neo4j.postid = Post0.id and neo4j.tagid = Tag0.id
##########
MATCH (f:Forum)-[:CONTAINER_OF]->(m:Message2)-[:HAS_CREATOR]->(p:Person)-[:LIKES]->(c:Comment2)

RETURN c.id as cid, p.id as pid, f.id as fid
**********
select neo4j.cid, Person0.firstName, Comment0.content, neo4j.fid, Forum0.title, neo4j.pid
from neo4j,Person Person0, Comment Comment0, Forum Forum0
where Forum0.title = $param and Comment0.length > $param and neo4j.pid = Person0.id and neo4j.cid = Comment0.id and neo4j.fid = Forum0.id
##########
MATCH (city:City)<-[:IS_LOCATED_IN]-(org:Organisation)<-[:STUDY_AT]-(person:Person)-[:HAS_INTEREST]->(tag:Tag)

RETURN person.id as personid, org.id as orgid, tag.id as tagid, city.id as cityid
**********
select Organisation0.name, Tag0.name, Person0.lastName, Person0.firstName
from neo4j,Tag Tag0, Organisation Organisation0, City City0, Person Person0
where Tag0.name = $param and City0.name = $param and neo4j.tagid = Tag0.id and neo4j.orgid = Organisation0.id and neo4j.cityid = City0.id and neo4j.personid = Person0.id
##########
MATCH (comment:Comment2)-[:REPLY_OF]->(post:Post1)-[:HAS_CREATOR]->(creator:Person1)

RETURN creator.id as creatorid, comment.id as commentid, post.id as postid
**********
select Post0.content, Person0.lastName, Person0.firstName, Comment0.content
from neo4j,Person Person0, Comment Comment0, Post Post0
where Comment0.creationDate > $param and Person0.birthday < $param and neo4j.creatorid = Person0.id and neo4j.commentid = Comment0.id and neo4j.postid = Post0.id
##########
MATCH (forum:Forum2)-[:HAS_MEMBER]->(member:Person1)-[:WORK_AT]->(company:Company)

RETURN member.id as memberid, forum.id as forumid, company.id as companyid
**********
select Forum0.title, Person0.lastName, Company0.name, Person0.firstName
from neo4j,Company Company0, Person Person0, Forum Forum0
where Forum0.title = $param and Company0.name = $param and neo4j.companyid = Company0.id and neo4j.memberid = Person0.id and neo4j.forumid = Forum0.id
##########
MATCH (p:Person1)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(c:City)-[:IS_PART_OF]->(co:Country)

RETURN u.id as uid, c.id as cid, p.id as pid, co.id as coid
**********
select University0.name, Person0.lastName, City0.name, Person0.firstName
from neo4j,Person Person0, University University0, City City0, Country Country0
where Person0.birthday < $param and Country0.name = $param and neo4j.pid = Person0.id and neo4j.uid = University0.id and neo4j.cid = City0.id and neo4j.coid = Country0.id
##########
MATCH (uni:University)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(person:Person1)

RETURN uni.id as uniid, person.id as personid, city.id as cityid
**********
select City0.name, Person0.lastName, Person0.firstName
from neo4j,University University0, City City0, Person Person0
where University0.name = $param and Person0.gender = $param and neo4j.uniid = University0.id and neo4j.cityid = City0.id and neo4j.personid = Person0.id
##########
MATCH (p:Person)-[:HAS_INTEREST]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)-[:IS_SUBCLASS_OF]->(tc2:TagClass)

RETURN tc2.id as tc2id, tc.id as tcid, p.id as pid
**********
select TagClass1.name, Person0.lastName, TagClass0.name, Person0.firstName
from neo4j,TagClass TagClass0, TagClass TagClass1, Person Person0
where Person0.email = $param and TagClass0.name = $param and neo4j.tc2id = TagClass0.id and neo4j.tcid = TagClass1.id and neo4j.pid = Person0.id
##########
MATCH (msg:Message1)-[:HAS_TAG]->(tag:Tag)-[:HAS_TYPE]->(tagClass:TagClass)

RETURN tagClass.id as tagClassid, msg.id as msgid, tag.id as tagid
**********
select Message0.content, Tag0.name, Message0.locationIP
from neo4j,TagClass TagClass0, Message Message0, Tag Tag0
where Message0.length > $param and TagClass0.name = $param and neo4j.tagClassid = TagClass0.id and neo4j.msgid = Message0.id and neo4j.tagid = Tag0.id
##########
MATCH (f:Forum1)-[:CONTAINER_OF]->(m:Message2)-[:HAS_CREATOR]->(p:Person1)-[:IS_LOCATED_IN]->(ci:City)-[:IS_PART_OF]->(co:Country)

RETURN ci.id as ciid, p.id as pid, f.id as fid, m.id as mid
**********
select Forum0.title, Message0.content, City0.name, Person0.firstName
from neo4j,Forum Forum0, Message Message0, Person Person0, City City0
where Forum0.creationDate > $param and Person0.gender = $param and neo4j.fid = Forum0.id and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.ciid = City0.id
##########
MATCH (p1:Person1)-[:KNOWS]->(p2:Person1)-[:LIKES]->(m:Message2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN t.id as tid, p1.id as p1id, p2.id as p2id, tc.id as tcid, m.id as mid
**********
select Person0.firstName, Message0.content, Tag0.name, neo4j.p2id
from neo4j,TagClass TagClass0, Message Message0, Person Person0, Person Person1, Tag Tag0
where Person1.firstName = $param and TagClass0.name = $param and neo4j.tcid = TagClass0.id and neo4j.mid = Message0.id and neo4j.p2id = Person0.id and neo4j.p1id = Person1.id and neo4j.tid = Tag0.id
##########
MATCH (p:Person)-[:WORK_AT]->(c:Company)-[:IS_LOCATED_IN]->(pl:Place)

RETURN pl.id as plid, c.id as cid, p.id as pid
**********
select Place0.name, Person0.lastName, Company0.name, Person0.firstName
from neo4j,Company Company0, Person Person0, Place Place0
where Place0.name = $param and Person0.firstName = $param and neo4j.cid = Company0.id and neo4j.pid = Person0.id and neo4j.plid = Place0.id
##########
MATCH (p:Person1)-[:KNOWS]->(p2:Person)-[:STUDY_AT]->(u:University)

RETURN t.id as tid, tc.id as tcid, m.id as mid
**********
select TagClass0.name, neo4j.mid, Message0.content, Tag0.name
from neo4j,Message Message0, TagClass TagClass0, Tag Tag0
where TagClass0.name = $param and Message0.content CONTAINS $param and neo4j.mid = Message0.id and neo4j.tcid = TagClass0.id and neo4j.tid = Tag0.id
##########
MATCH (p:Person)-[:WORK_AT]->(o:Organisation)-[:IS_LOCATED_IN]->(ci:City)

RETURN ci.id as ciid, o.id as oid, p.id as pid
**********
select Organisation0.name, Person0.lastName, City0.name, Person0.firstName
from neo4j,Organisation Organisation0, City City0, Person Person0
where City0.name = $param and Person0.browserUsed = $param and neo4j.oid = Organisation0.id and neo4j.ciid = City0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person)-[:HAS_INTEREST]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN tc.id as tcid, p.id as pid, t.id as tid
**********
select TagClass0.name, Person0.lastName, Tag0.name, Person0.firstName
from neo4j,Person Person0, Tag Tag0, TagClass TagClass0
where TagClass0.name = $param and Person0.gender = $param and neo4j.pid = Person0.id and neo4j.tid = Tag0.id and neo4j.tcid = TagClass0.id
##########
MATCH (f:Forum2)-[:HAS_MEMBER]->(p:Person1)-[:IS_LOCATED_IN]->(ct:City)

RETURN ct.id as ctid, p.id as pid, f.id as fid
**********
select Forum0.title, City0.name, Person0.lastName, Person0.firstName
from neo4j,City City0, Person Person0, Forum Forum0
where Forum0.title = $param and City0.name = $param and neo4j.ctid = City0.id and neo4j.pid = Person0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(ct:City)

RETURN org.id as orgid, ct.id as ctid, p.id as pid
**********
select Organisation0.name, City0.name, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Organisation Organisation0, City City0
where Organisation0.name = $param and Person0.gender = $param and neo4j.pid = Person0.id and neo4j.orgid = Organisation0.id and neo4j.ctid = City0.id
##########
MATCH (msg:Message1)-[:REPLY_OF]->(post:Post1)-[:HAS_CREATOR]->(creator:Person1)

RETURN creator.id as creatorid, post.id as postid, msg.id as msgid
**********
select Message0.content, Post0.content, Person0.lastName, Person0.firstName
from neo4j,Message Message0, Person Person0, Post Post0
where Post0.locationIP = $param and Message0.creationDate > $param and neo4j.msgid = Message0.id and neo4j.creatorid = Person0.id and neo4j.postid = Post0.id
##########
MATCH (post:Post2)-[:HAS_TAG]->(tag:Tag)-[:HAS_TYPE]->(tagClass:TagClass)-[:IS_SUBCLASS_OF]->(superClass:TagClass)

RETURN tagClass.id as tagClassid, tag.id as tagid, superClass.id as superClassid, post.id as postid
**********
select Tag0.name, TagClass0.name, Post0.content, TagClass1.name
from neo4j,TagClass TagClass0, Post Post0, TagClass TagClass1, Tag Tag0
where Post0.creationDate > $param and TagClass0.name = $param and neo4j.tagClassid = TagClass0.id and neo4j.postid = Post0.id and neo4j.superClassid = TagClass1.id and neo4j.tagid = Tag0.id
##########
MATCH (p:Person)-[:KNOWS]->(friend:Person)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(city:City)

RETURN friend.id as friendid, org.id as orgid, p.id as pid, city.id as cityid
**********
select Organisation0.name, City0.name, Person1.lastName, Person0.firstName, Person1.firstName, Person0.lastName
from neo4j,Person Person0, City City0, Person Person1, Organisation Organisation0
where Person1.birthday < $param and City0.name = $param and neo4j.pid = Person0.id and neo4j.cityid = City0.id and neo4j.friendid = Person1.id and neo4j.orgid = Organisation0.id
##########
MATCH (c:City)<-[:IS_LOCATED_IN]-(o:Organisation)<-[:WORK_AT]-(p:Person1)-[:HAS_INTEREST]->(t:Tag)

RETURN c.id as cid, p.id as pid, t.id as tid
**********
select Person0.firstName, Person0.lastName, neo4j.pid
from neo4j,Tag Tag0, City City0, Person Person0
where Tag0.name = $param and City0.name = $param and neo4j.tid = Tag0.id and neo4j.cid = City0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(comp:Company)-[:IS_LOCATED_IN]->(country:Country)

RETURN country.id as countryid, p.id as pid, comp.id as compid
**********
select Country0.name, Person0.lastName, Company0.name, Person0.firstName
from neo4j,Company Company0, Country Country0, Person Person0
where Country0.name = $param and Person0.speaks CONTAINS $param and Person0.browserUsed = $param and neo4j.compid = Company0.id and neo4j.countryid = Country0.id and neo4j.pid = Person0.id
##########
MATCH (forum:Forum1)-[:HAS_MEMBER]->(member:Person1)-[:STUDY_AT]->(uni:University)

RETURN uni.id as uniid, member.id as memberid, forum.id as forumid
**********
select Forum0.title, Person0.lastName, University0.name, Person0.firstName
from neo4j,University University0, Person Person0, Forum Forum0
where University0.name = $param and Forum0.creationDate > $param and neo4j.uniid = University0.id and neo4j.memberid = Person0.id and neo4j.forumid = Forum0.id
##########
MATCH (forum:Forum1)-[:CONTAINER_OF]->(post:Post2)-[:HAS_TAG]->(tag:Tag)

RETURN post.id as postid, forum.id as forumid, tag.id as tagid
**********
select Forum0.title, Tag0.name, Post0.content
from neo4j,Post Post0, Forum Forum0, Tag Tag0
where Forum0.title = $param and Tag0.name = $param and neo4j.postid = Post0.id and neo4j.forumid = Forum0.id and neo4j.tagid = Tag0.id
##########
MATCH (person:Person)-[:KNOWS]->(friend:Person)-[:LIKES]->(post:Post2)-[:HAS_CREATOR]->(creator:Person)

RETURN friend.id as friendid, person.id as personid, creator.id as creatorid, post.id as postid
**********
select Person2.firstName, Post0.content, Person2.lastName
from neo4j,Person Person0, Person Person1, Post Post0, Person Person2
where Person1.locationIP = $param and Person0.email = $param and neo4j.personid = Person0.id and neo4j.creatorid = Person1.id and neo4j.postid = Post0.id and neo4j.friendid = Person2.id
##########
MATCH (p:Person)-[:LIKES]->(m:Message2)<-[:REPLY_OF]-(cm:Comment2)-[:HAS_TAG]->(t:Tag)

RETURN p.id as pid, cm.id as cmid, t.id as tid
**********
select Comment0.content, neo4j.cmid
from neo4j,Person Person0, Tag Tag0, Comment Comment0
where Tag0.name = $param and Person0.email = $param and neo4j.pid = Person0.id and neo4j.tid = Tag0.id and neo4j.cmid = Comment0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(:Tag)<-[:HAS_TAG]-(msg:Message2)-[:REPLY_OF*1..2]->(post:Post2)

RETURN msg.id as msgid, p.id as pid, post.title as posttitle
**********
select Message0.content, neo4j.posttitle, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Message Message0
where Message0.length < $param and Person0.speaks = $param and neo4j.pid = Person0.id and neo4j.msgid = Message0.id
##########
MATCH (msg:Message1)-[:HAS_CREATOR]->(creator:Person)-[:IS_LOCATED_IN]->(city:City)

RETURN org.id as orgid, country.id as countryid, city.id as cityid
**********
select Organisation0.name, City0.name, Country0.name
from neo4j,Organisation Organisation0, City City0, Country Country0
where Country0.name = $param and City0.name = $param and neo4j.orgid = Organisation0.id and neo4j.cityid = City0.id and neo4j.countryid = Country0.id
##########
MATCH (person:Person1)-[:STUDY_AT]->(univ:University)-[:IS_LOCATED_IN]->(city:City)

RETURN person.id as personid, univ.id as univid, city.id as cityid
**********
select City0.name, University0.name, Person0.lastName, Person0.firstName
from neo4j,City City0, Person Person0, University University0
where Person0.speaks = $param and City0.name = $param and neo4j.cityid = City0.id and neo4j.personid = Person0.id and neo4j.univid = University0.id
##########
MATCH (univ:University)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(person:Person1)

RETURN person.id as personid, univ.id as univid, city.id as cityid
**********
select University0.name, City0.name, Person0.lastName, Person0.firstName
from neo4j,City City0, Person Person0, University University0
where Person0.gender = $param and neo4j.cityid = City0.id and neo4j.personid = Person0.id and neo4j.univid = University0.id
##########
MATCH (p:Person1)-[:STUDY_AT]->(uni:University)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(org:Organisation)

RETURN org.id as orgid, p.id as pid, city.id as cityid
**********
select Organisation0.name, City0.name, Person0.lastName, Person0.firstName
from neo4j,Organisation Organisation0, Person Person0, City City0
where Person0.birthday < $param and Organisation0.name = $param and neo4j.orgid = Organisation0.id and neo4j.pid = Person0.id and neo4j.cityid = City0.id
##########
MATCH (cmt:Comment2)-[:HAS_TAG]->(tag:Tag)<-[:HAS_TAG]-(post:Post1)

RETURN tag.id as tagid, post.id as postid, cmt.id as cmtid
**********
select Tag0.name, Post0.content, Comment0.content
from neo4j,Post Post0, Comment Comment0, Tag Tag0
where Post0.length > $param and Comment0.creationDate < $param and neo4j.postid = Post0.id and neo4j.cmtid = Comment0.id and neo4j.tagid = Tag0.id
##########
MATCH (p:Person1)-[:LIKES]->(comment:Comment1)-[:REPLY_OF]->(post:Post1)-[:HAS_CREATOR]->(creator:Person)

RETURN creator.id as creatorid, comment.id as commentid, p.id as pid, post.title as posttitle
**********
select Comment0.content, neo4j.posttitle, Person1.lastName, Person1.firstName
from neo4j,Person Person0, Person Person1, Comment Comment0
where Person1.email = $param and Person0.birthday > $param and neo4j.creatorid = Person0.id and neo4j.pid = Person1.id and neo4j.commentid = Comment0.id
##########
MATCH (post:Post2)-[:HAS_TAG]->(tag:Tag)-[:HAS_TYPE]->(tagClass:TagClass)

RETURN tagClass.id as tagClassid, tag.id as tagid, post.id as postid
**********
select neo4j.postid, Tag0.name, Post0.content
from neo4j,Post Post0, TagClass TagClass0, Tag Tag0
where Post0.creationDate > $param and TagClass0.name = $param and neo4j.postid = Post0.id and neo4j.tagClassid = TagClass0.id and neo4j.tagid = Tag0.id
##########
MATCH (org:Organisation)-[:IS_LOCATED_IN]->(city:City)-[:IS_PART_OF]->(country:Country)
RETURN org.id as orgid, country.id as countryid, city.id as cityid
**********
select Organisation0.name, City0.name, Country0.name
from neo4j,City City0, Country Country0, Organisation Organisation0
where Country0.name = $param and neo4j.cityid = City0.id and neo4j.countryid = Country0.id and neo4j.orgid = Organisation0.id
##########
MATCH (msg:Message1)-[:REPLY_OF*2]->(post:Post2)-[:HAS_CREATOR]->(creator:Person1)

RETURN creator.id as creatorid, msg.id as msgid, post.title as posttitle
**********
select Message0.content, neo4j.posttitle, Person0.lastName, Person0.firstName
from neo4j,Message Message0, Person Person0
where Message0.creationDate > $param and neo4j.msgid = Message0.id and neo4j.creatorid = Person0.id
##########
MATCH (forum:Forum1)-[:CONTAINER_OF]->(msg:Message2)-[:HAS_CREATOR]->(creator:Person1)

RETURN creator.id as creatorid, msg.id as msgid, forum.id as forumid
**********
select Message0.content, Forum0.title, Person0.lastName, Person0.firstName
from neo4j,Forum Forum0, Person Person0, Message Message0
where Message0.browserUsed = $param and Person0.speaks CONTAINS $param and neo4j.forumid = Forum0.id and neo4j.creatorid = Person0.id and neo4j.msgid = Message0.id
##########
MATCH (p:Person1)-[:STUDY_AT]->(uni:University)-[:IS_LOCATED_IN]->(place:Place)

RETURN uni.id as uniid, place.id as placeid, p.id as pid
**********
select Person0.lastName, Place0.name, Person0.firstName
from neo4j,Place Place0, University University0, Person Person0
where Person0.email CONTAINS $param and University0.name = $param and neo4j.placeid = Place0.id and neo4j.uniid = University0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person1)-[:STUDY_AT]->(univ:University)-[:IS_LOCATED_IN]->(place:Place)

RETURN tagClass.id as tagClassid, msg.id as msgid, tag.id as tagid
**********
select Message0.content, Tag0.name, TagClass0.name
from neo4j,Message Message0, TagClass TagClass0, Tag Tag0
where Message0.locationIP = $param and neo4j.msgid = Message0.id and neo4j.tagClassid = TagClass0.id and neo4j.tagid = Tag0.id
##########
MATCH (p:Person)-[:KNOWS]->(friend:Person1)-[:STUDY_AT]->(uni:University)-[:IS_LOCATED_IN]->(city:City)

RETURN friend.id as friendid, p.id as pid, city.id as cityid
**********
select Person0.firstName, Person1.lastName, Person0.lastName, Person1.firstName
from neo4j,Person Person0, City City0, Person Person1
where Person1.locationIP = $param and City0.name = $param and neo4j.friendid = Person0.id and neo4j.cityid = City0.id and neo4j.pid = Person1.id
##########
MATCH (comp1:Company)-[:IS_LOCATED_IN]->(country:Country)<-[:IS_LOCATED_IN]-(comp2:Company)

RETURN comp2.id as comp2id, country.id as countryid, comp1.id as comp1id
**********
select Company1.name, Company0.name
from neo4j,Country Country0, Company Company0, Company Company1
where Country0.name = $param and Company0.name = $param and neo4j.countryid = Country0.id and neo4j.comp1id = Company0.id and neo4j.comp2id = Company1.id
##########
MATCH (person:Person)-[:HAS_CREATOR]-(msg:Message2)<-[:REPLY_OF*]-(cmt:Comment2)

RETURN person.id as personid, msg.id as msgid, cmt.id as cmtid
**********
select Message0.content, Person0.lastName, Comment0.content, Person0.firstName
from neo4j,Person Person0, Comment Comment0, Message Message0
where Person0.gender = $param and Comment0.length < $param and neo4j.personid = Person0.id and neo4j.cmtid = Comment0.id and neo4j.msgid = Message0.id
##########
MATCH (p:Person1)-[:KNOWS*2..3]-(friend:Person1)

RETURN friend.id as friendid, p.id as pid
**********
select Person1.email, Person1.firstName, Person1.lastName
from neo4j,Person Person0, Person Person1
where Person0.firstName = $param and Person1.gender = $param and neo4j.pid = Person0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_LOCATED_IN]-(m:Message2)

RETURN place.id as placeid, p.id as pid, m.id as mid
**********
select Message0.length, Message0.content, Place0.name
from neo4j,Person Person0, Place Place0, Message Message0
where Person0.speaks CONTAINS $param and Message0.browserUsed = $param and neo4j.pid = Person0.id and neo4j.placeid = Place0.id and neo4j.mid = Message0.id
##########
MATCH (fo:Forum)-[:CONTAINER_OF]->(m:Message2)-[:HAS_CREATOR]->(p:Person)-[:IS_LOCATED_IN]->(place:Place)

RETURN fo.id as foid, place.id as placeid, p.id as pid, m.id as mid
**********
select Person0.firstName, Place0.name, Forum0.title, Message0.content, Person0.lastName
from neo4j,Person Person0, Message Message0, Place Place0, Forum Forum0
where Forum0.creationDate > $param and neo4j.pid = Person0.id and neo4j.mid = Message0.id and neo4j.placeid = Place0.id and neo4j.foid = Forum0.id
##########
MATCH (univ:University)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(p:Person1)-[:WORK_AT]->(comp:Company)

RETURN univ.id as univid, p.id as pid, comp.id as compid
**********
select Person0.email, Person0.lastName, Person0.firstName
from neo4j,Person Person0, University University0, Company Company0
where Company0.name = $param and University0.name = $param and neo4j.pid = Person0.id and neo4j.univid = University0.id and neo4j.compid = Company0.id
##########
MATCH (org:Organisation)-[:IS_LOCATED_IN]->(country:Country)<-[:IS_LOCATED_IN]-(msg:Message1)

RETURN org.id as orgid, msg.id as msgid, country.id as countryid
**********
select Organisation0.name, Country0.name, Message0.content
from neo4j,Organisation Organisation0, Country Country0, Message Message0
where Organisation0.name = $param and Message0.length < $param and neo4j.orgid = Organisation0.id and neo4j.countryid = Country0.id and neo4j.msgid = Message0.id
##########
MATCH (forum:Forum1)-[:HAS_MEMBER]->(person:Person1)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(comment:Comment2)-[:REPLY_OF]->(post:Post2)

RETURN person.id as personid, comment.id as commentid, post.id as postid, forum.id as forumid
**********
select Person0.lastName, Post0.content, Person0.firstName
from neo4j,Comment Comment0, Person Person0, Post Post0, Forum Forum0
where Forum0.title = $param and Comment0.length > $param and neo4j.commentid = Comment0.id and neo4j.personid = Person0.id and neo4j.postid = Post0.id and neo4j.forumid = Forum0.id
##########
MATCH (c:Comment1)-[:REPLY_OF]->(m:Message1)-[:HAS_TAG]->(t:Tag)

RETURN t.id as tid, c.id as cid, m.id as mid
**********
select Message0.content, Tag0.name, Comment0.content
from neo4j,Comment Comment0, Message Message0, Tag Tag0
where Tag0.name = $param and Message0.creationDate > $param and neo4j.cid = Comment0.id and neo4j.mid = Message0.id and neo4j.tid = Tag0.id
##########
MATCH (org:Organisation)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(uni:University)<-[:STUDY_AT]-(student:Person1)

RETURN student.id as studentid, org.id as orgid
**********
select Person0.lastName, Person0.firstName, neo4j.studentid
from neo4j,Person Person0, Organisation Organisation0
where Organisation0.name = $param and Person0.birthday < $param and neo4j.studentid = Person0.id and neo4j.orgid = Organisation0.id
##########
MATCH (f:Forum)-[:CONTAINER_OF]->(p:Post2)-[:HAS_TAG]->(yh:Tag)<-[:HAS_INTEREST]-(person:Person1)

RETURN yh.id as yhid, p.id as pid, f.id as fid
**********
select Post0.creationDate, Post0.content, neo4j.pid
from neo4j,Post Post0, Tag Tag0, Forum Forum0
where Tag0.name = $param and Forum0.creationDate > $param and neo4j.pid = Post0.id and neo4j.yhid = Tag0.id and neo4j.fid = Forum0.id
##########
MATCH (c:Comment2)-[:REPLY_OF*1..2]->(m:Message1)-[:HAS_CREATOR]->(p:Person1)

RETURN c.id as cid, p.id as pid
**********
select Comment0.creationDate, Comment0.content, neo4j.cid
from neo4j,Person Person0, Comment Comment0
where Person0.locationIP = $param and Comment0.creationDate > $param and neo4j.pid = Person0.id and neo4j.cid = Comment0.id
##########
MATCH (msg:Message2)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_PART_OF]-(country:Country)

RETURN msg.id as msgid, country.id as countryid
**********
select Message0.content, Message0.creationDate, neo4j.msgid
from neo4j,Message Message0, Country Country0
where Message0.browserUsed = $param and Country0.name = $param and neo4j.msgid = Message0.id and neo4j.countryid = Country0.id
##########
MATCH (comment:Comment1)-[:HAS_TAG]->(tag:Tag)-[:HAS_TYPE]->(tagClass:TagClass)<-[:IS_SUBCLASS_OF]-(parentClass:TagClass)

RETURN tagClass.id as tagClassid, comment.id as commentid
**********
select neo4j.commentid, Comment0.creationDate, Comment0.content
from neo4j,TagClass TagClass0, Comment Comment0
where TagClass0.name = $param and neo4j.tagClassid = TagClass0.id and neo4j.commentid = Comment0.id
##########
MATCH (p:Person1)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(city:City)-[:IS_PART_OF]->(country:Country)

RETURN u.id as uid, country.id as countryid, p.id as pid, city.id as cityid
**********
select City0.name, Person0.firstName, University0.name, Country0.name, Person0.lastName
from neo4j,City City0, Country Country0, University University0, Person Person0
where Person0.birthday > $param and neo4j.cityid = City0.id and neo4j.countryid = Country0.id and neo4j.uid = University0.id and neo4j.pid = Person0.id
##########
MATCH (tc:TagClass)-[:IS_SUBCLASS_OF*1..]->(:TagClass)-[:HAS_TYPE]-(tag:Tag)<-[:HAS_TAG]-(post:Post1)-[:HAS_CREATOR]->(p:Person1)

RETURN t.id as tid, tc.id as tcid, m.id as mid
**********
select TagClass0.name, neo4j.mid, Message0.content, Tag0.name
from neo4j,TagClass TagClass0, Tag Tag0, Message Message0
where TagClass0.name = $param and Message0.creationDate > $param and neo4j.tcid = TagClass0.id and neo4j.tid = Tag0.id and neo4j.mid = Message0.id
##########
MATCH (person:Person1)-[:HAS_INTEREST]->(:Tag)<-[:HAS_TAG]-(c:Comment2)-[:REPLY_OF*1..]->(m:Message2)-[:HAS_CREATOR]->(creator:Person1)

RETURN person.id as personid, creator.id as creatorid
**********
select neo4j.creatorid, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Person Person1
where Person1.firstName = $param and neo4j.creatorid = Person0.id and neo4j.personid = Person1.id
##########
MATCH (p:Person)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(r:City)<-[:IS_LOCATED_IN]-(org:Organisation)

RETURN r.id as rid, org.id as orgid, p.id as pid
**********
select Organisation0.name, neo4j.orgid
from neo4j,Person Person0, City City0, Organisation Organisation0
where City0.name = $param and Person0.speaks = $param and neo4j.pid = Person0.id and neo4j.rid = City0.id and neo4j.orgid = Organisation0.id
##########
MATCH (p:Person)-[:WORK_AT]->(company:Company)-[:IS_LOCATED_IN]->(ig:Country)

RETURN ig.id as igid, p.id as pid
**********
select Person0.firstName, Person0.lastName, neo4j.pid
from neo4j,Person Person0, Country Country0
where Country0.name = $param and Person0.browserUsed = $param and neo4j.pid = Person0.id and neo4j.igid = Country0.id
##########
MATCH (person:Person1)-[:WORK_AT]->(company:Company)-[:IS_LOCATED_IN]->(country:Country)-[:IS_PART_OF]->(continent:Continent)

RETURN company.id as companyid, person.id as personid, continent.id as continentid, country.id as countryid
**********
select Continent0.name, Person0.lastName, Company0.name, Person0.firstName
from neo4j,Country Country0, Person Person0, Company Company0, Continent Continent0
where Country0.name = $param and Person0.gender = $param and neo4j.countryid = Country0.id and neo4j.personid = Person0.id and neo4j.companyid = Company0.id and neo4j.continentid = Continent0.id
##########
MATCH (msg:Message1)-[:HAS_TAG]->(:Tag)<-[:HAS_TAG]-(related:Message1)

RETURN msg.id as msgid, related.id as relatedid
**********
select Message0.content, Message1.content
from neo4j,Message Message0, Message Message1
where Message1.browserUsed = $param and Message0.locationIP = $param and neo4j.msgid = Message0.id and neo4j.relatedid = Message1.id
##########
MATCH (forum:Forum1)-[:CONTAINER_OF]->(post:Post1)-[:HAS_TAG]->(qo:Tag)

RETURN qo.id as qoid, forum.id as forumid, post.id as postid
**********
select Forum0.title, Post0.content
from neo4j,Tag Tag0, Post Post0, Forum Forum0
where Tag0.name = $param and Forum0.creationDate > $param and neo4j.qoid = Tag0.id and neo4j.postid = Post0.id and neo4j.forumid = Forum0.id
##########
MATCH (person:Person)-[:HAS_INTEREST]->(tag:Tag)-[:HAS_TYPE]->(t:TagClass)

RETURN person.id as personid, tag.id as tagid, t.id as tid
**********
select Tag0.name, Person0.lastName, Person0.firstName
from neo4j,Tag Tag0, TagClass TagClass0, Person Person0
where TagClass0.name = $param and Person0.birthday < $param and neo4j.tagid = Tag0.id and neo4j.tid = TagClass0.id and neo4j.personid = Person0.id
##########
MATCH (person:Person1)-[:WORK_AT]->(company:Company)-[:IS_LOCATED_IN]->(n:Country)

RETURN company.id as companyid, person.id as personid, n.id as nid
**********
select Person0.lastName, Company0.name, Person0.firstName
from neo4j,Country Country0, Company Company0, Person Person0
where Country0.name = $param and Person0.gender = $param and neo4j.nid = Country0.id and neo4j.companyid = Company0.id and neo4j.personid = Person0.id
##########
MATCH (f:Forum1)-[:CONTAINER_OF]->(m:Message1)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN m.id as mid, tc.id as tcid, f.id as fid, t.id as tid
**********
select neo4j.fid, Tag0.name, TagClass0.name, Forum0.title, Message0.content
from neo4j,Tag Tag0, Forum Forum0, Message Message0, TagClass TagClass0
where Forum0.title = $param and TagClass0.name = $param and neo4j.tid = Tag0.id and neo4j.fid = Forum0.id and neo4j.mid = Message0.id and neo4j.tcid = TagClass0.id
##########
MATCH (msg:Message2)-[:REPLY_OF]->(origMsg:Post2)-[:HAS_CREATOR]->(creator:Person)

RETURN creator.id as creatorid, msg.id as msgid, origMsg.id as origMsgid
**********
select Person0.firstName, Message0.content, neo4j.origMsgid, neo4j.msgid, Person0.lastName
from neo4j,Message Message0, Person Person0
where Message0.content CONTAINS $param and Person0.birthday > $param and neo4j.msgid = Message0.id and neo4j.creatorid = Person0.id
##########
MATCH (per:Person)-[:KNOWS]->(friend:Person)-[:STUDY_AT]->(u:University)

RETURN friend.id as friendid, per.id as perid, u.id as uid
**********
select Person1.firstName, Person0.firstName, University0.name, neo4j.perid
from neo4j,University University0, Person Person0, Person Person1
where Person0.gender = $param and Person1.email = $param and neo4j.uid = University0.id and neo4j.friendid = Person0.id and neo4j.perid = Person1.id
##########
MATCH (company:Company)<-[:WORK_AT]-(person:Person1)-[:KNOWS]-(friend:Person1)-[:STUDY_AT]->(uni:University)

RETURN uni.id as uniid, friend.id as friendid, company.id as companyid, person.id as personid
**********
select University0.name, Person0.lastName, Company0.name, Person0.firstName, Person1.lastName, Person1.firstName
from neo4j,Company Company0, Person Person0, Person Person1, University University0
where University0.name = $param and Company0.name = $param and neo4j.companyid = Company0.id and neo4j.friendid = Person0.id and neo4j.personid = Person1.id and neo4j.uniid = University0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(p:Person1)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(place:Place)

RETURN place.id as placeid, u.id as uid, p.id as pid, f.id as fid
**********
select Person0.firstName, University0.name, Place0.name, Forum0.title, Person0.lastName
from neo4j,Place Place0, Forum Forum0, University University0, Person Person0
where Forum0.creationDate > $param and Place0.name = $param and neo4j.placeid = Place0.id and neo4j.fid = Forum0.id and neo4j.uid = University0.id and neo4j.pid = Person0.id
##########
MATCH (t:Tag)<-[:HAS_TAG]-(m:Message1)<-[:REPLY_OF]-(comment:Comment2)-[:HAS_CREATOR]->(p:Person)

