RETURN m.id as mid, comment.id as commentid, p.id as pid, t.id as tid
**********
select Person0.firstName, neo4j.commentid, Tag0.name, neo4j.mid, Person0.lastName
from neo4j,Tag Tag0, Person Person0, Message Message0
where Tag0.name = $param and Message0.creationDate < $param and neo4j.tid = Tag0.id and neo4j.pid = Person0.id and neo4j.mid = Message0.id
##########
MATCH (person:Person1)-[:LIKES]->(msg:Message1)-[:HAS_TAG]->(tag:Tag)-[:HAS_TYPE]->(tagClass:TagClass)

RETURN tagClass.id as tagClassid, person.id as personid, msg.id as msgid, tag.id as tagid
**********
select Message0.content, Tag0.name, TagClass0.name, Person0.lastName, Person0.firstName
from neo4j,TagClass TagClass0, Tag Tag0, Message Message0, Person Person0
where Person0.gender = $param and TagClass0.name = $param and neo4j.tagClassid = TagClass0.id and neo4j.tagid = Tag0.id and neo4j.msgid = Message0.id and neo4j.personid = Person0.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person1)-[:WORK_AT]->(company:Company)

RETURN friend.id as friendid, company.id as companyid, p.id as pid
**********
select neo4j.companyid, Company0.name, Person1.firstName, Person0.firstName, neo4j.friendid, neo4j.pid
from neo4j,Company Company0, Person Person0, Person Person1
where Person1.firstName = $param and Person0.gender = $param and neo4j.companyid = Company0.id and neo4j.friendid = Person0.id and neo4j.pid = Person1.id
##########
MATCH (person:Person)-[:HAS_CREATOR]-(msg:Message1)-[:IS_LOCATED_IN]->(country:Country)

RETURN person.id as personid, msg.id as msgid, country.id as countryid
**********
select Message0.content, Country0.name, Person0.lastName, Person0.firstName
from neo4j,Message Message0, Person Person0, Country Country0
where Country0.name = $param and Person0.email = $param and neo4j.msgid = Message0.id and neo4j.personid = Person0.id and neo4j.countryid = Country0.id
##########
MATCH (msg:Message2)-[:REPLY_OF*]->(original:Post1)<-[:CONTAINER_OF]-(forum:Forum2)

RETURN org.id as orgid, country.id as countryid, p.id as pid
**********
select Organisation0.name, neo4j.orgid, Person0.firstName, Country0.name, neo4j.countryid, neo4j.pid
from neo4j,Organisation Organisation0, Country Country0, Person Person0
where Country0.name = $param and Person0.gender = $param and neo4j.orgid = Organisation0.id and neo4j.countryid = Country0.id and neo4j.pid = Person0.id
##########
MATCH (c:Comment1)-[:REPLY_OF*1..3]->(root:Post2)-[:HAS_CREATOR]->(creator:Person1)

RETURN root.title as roottitle, creator.id as creatorid, c.id as cid
**********
select neo4j.roottitle, Person0.lastName, Person0.firstName, Comment0.content
from neo4j,Comment Comment0, Person Person0
where Comment0.creationDate > $param and Person0.birthday < $param and neo4j.cid = Comment0.id and neo4j.creatorid = Person0.id
##########
MATCH (forum:Forum)-[:HAS_MODERATOR]->(mod:Person1)-[:KNOWS]->(friend:Person)

RETURN mod.id as modid, friend.id as friendid, forum.id as forumid
**********
select Forum0.title, neo4j.modid, neo4j.forumid, Person1.firstName, Person0.firstName, neo4j.friendid
from neo4j,Forum Forum0, Person Person0, Person Person1
where Person0.gender = $param and Forum0.title = $param and neo4j.forumid = Forum0.id and neo4j.modid = Person0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person1)-[:WORK_AT]->(company:Company)-[:IS_LOCATED_IN]->(place:Place)

RETURN company.id as companyid, place.id as placeid, p.id as pid
**********
select neo4j.companyid, Company0.name, Person0.firstName, Place0.name, neo4j.pid, neo4j.placeid
from neo4j,Place Place0, Person Person0, Company Company0
where Company0.name = $param and Person0.browserUsed = $param and neo4j.placeid = Place0.id and neo4j.pid = Person0.id and neo4j.companyid = Company0.id
##########
MATCH (p:Person1)-[:LIKES]->(msg:Message1)-[:HAS_TAG]->(tag:Tag)

RETURN p1.id as p1id, p2.id as p2id, c.id as cid
**********
select Person1.firstName, Company0.name, Person0.lastName, Person1.lastName, Person0.firstName
from neo4j,Person Person0, Company Company0, Person Person1
where Person0.speaks = $param and Company0.name = $param and neo4j.p1id = Person0.id and neo4j.cid = Company0.id and neo4j.p2id = Person1.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)-[:IS_SUBCLASS_OF]->(super:TagClass)

RETURN super.id as superid, tc.id as tcid, p.id as pid, t.id as tid
**********
select Person0.firstName, TagClass0.name, Tag0.name, TagClass1.name, Person0.lastName
from neo4j,Person Person0, Tag Tag0, TagClass TagClass0, TagClass TagClass1
where TagClass0.name = $param and TagClass1.name = $param and neo4j.pid = Person0.id and neo4j.tid = Tag0.id and neo4j.superid = TagClass0.id and neo4j.tcid = TagClass1.id
##########
MATCH (p:Person1)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(city:City)-[:IS_PART_OF]->(country:Country)

RETURN org.id as orgid, country.id as countryid, p.id as pid, city.id as cityid
**********
select Organisation0.name, City0.name, Person0.firstName, Country0.name, Person0.lastName
from neo4j,Country Country0, Organisation Organisation0, City City0, Person Person0
where Person0.gender = $param and City0.name = $param and neo4j.countryid = Country0.id and neo4j.orgid = Organisation0.id and neo4j.cityid = City0.id and neo4j.pid = Person0.id
##########
MATCH (f:Forum1)-[:CONTAINER_OF]->(msg:Message1)-[:HAS_CREATOR]->(creator:Person)

RETURN creator.id as creatorid, msg.id as msgid, f.id as fid
**********
select Message0.content, Forum0.title, Person0.lastName, Person0.firstName
from neo4j,Forum Forum0, Message Message0, Person Person0
where Person0.email CONTAINS $param and Forum0.creationDate < $param and neo4j.fid = Forum0.id and neo4j.msgid = Message0.id and neo4j.creatorid = Person0.id
##########
MATCH (tc:TagClass)<-[:HAS_TYPE]-(t:Tag)<-[:HAS_TAG]-(msg:Message2)<-[:REPLY_OF]-(c:Comment2)

RETURN msg.id as msgid, tc.id as tcid, c.id as cid, t.id as tid
**********
select Message0.content, Tag0.name, Comment0.content
from neo4j,TagClass TagClass0, Tag Tag0, Message Message0, Comment Comment0
where TagClass0.name = $param and Comment0.creationDate > $param and neo4j.tcid = TagClass0.id and neo4j.tid = Tag0.id and neo4j.msgid = Message0.id and neo4j.cid = Comment0.id
##########
MATCH (org:Organisation)<-[:WORK_AT]-(p:Person1)-[:KNOWS]->(friend:Person)-[:LIKES]->(post:Post1)

RETURN friend.id as friendid, org.id as orgid, post.id as postid, p.id as pid
**********
select Person0.lastName, Person1.lastName, Person0.firstName, Person1.firstName, Post0.content
from neo4j,Person Person0, Organisation Organisation0, Person Person1, Post Post0
where Post0.creationDate > $param and Organisation0.name = $param and neo4j.pid = Person0.id and neo4j.orgid = Organisation0.id and neo4j.friendid = Person1.id and neo4j.postid = Post0.id
##########
MATCH (p:Person)-[:LIKES]->(msg:Message1)-[:HAS_CREATOR]->(creator:Person1)-[:IS_LOCATED_IN]->(place:Place)

RETURN creator.id as creatorid, place.id as placeid, msg.id as msgid, p.id as pid
**********
select Person0.firstName, Message0.content, Person1.firstName, Place0.name, Person1.lastName, Person0.lastName
from neo4j,Person Person0, Message Message0, Place Place0, Person Person1
where Person1.locationIP = $param and Message0.length > $param and neo4j.creatorid = Person0.id and neo4j.msgid = Message0.id and neo4j.placeid = Place0.id and neo4j.pid = Person1.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(forum:Forum2)-[:HAS_MODERATOR]->(moderator:Person)

RETURN moderator.id as moderatorid, tag.id as tagid, forum.id as forumid, p.id as pid
**********
select Forum0.title, Person1.lastName, Person1.firstName, Person0.firstName, Person0.lastName
from neo4j,Tag Tag0, Forum Forum0, Person Person0, Person Person1
where Person1.locationIP = $param and Tag0.name = $param and neo4j.tagid = Tag0.id and neo4j.forumid = Forum0.id and neo4j.moderatorid = Person0.id and neo4j.pid = Person1.id
##########
MATCH (p:Person1)-[:WORK_AT]->(c:Company)-[:IS_LOCATED_IN]->(country:Country), (p)-[:KNOWS]->(friend:Person1)
RETURN friend.id as friendid, c.id as cid, country.id as countryid, p.id as pid
**********
select Company0.name, Person1.lastName, Person0.firstName, Person1.firstName, Person0.lastName
from neo4j,Company Company0, Person Person0, Country Country0, Person Person1
where Country0.name = $param and neo4j.cid = Company0.id and neo4j.pid = Person0.id and neo4j.countryid = Country0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person)-[:HAS_INTEREST]->(:Tag)<-[:HAS_TAG]-(msg:Message1)-[:REPLY_OF]->(comment:Comment2)

RETURN comment.id as commentid, msg.id as msgid, p.id as pid
**********
select Comment0.content, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Comment Comment0, Message Message0
where Person0.speaks CONTAINS $param and Message0.length > $param and neo4j.pid = Person0.id and neo4j.commentid = Comment0.id and neo4j.msgid = Message0.id
##########
MATCH (c:City)<-[:IS_LOCATED_IN]-(org:Organisation)<-[:WORK_AT]-(p:Person1)

RETURN org.id as orgid, c.id as cid, p.id as pid
**********
select Organisation0.name, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Organisation Organisation0, City City0
where Organisation0.name = $param and City0.name = $param and neo4j.pid = Person0.id and neo4j.orgid = Organisation0.id and neo4j.cid = City0.id
##########
MATCH (p:Person)-[:LIKES]->(post:Post2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)
RETURN post.id as postid, tc.id as tcid, p.id as pid, t.id as tid
**********
select Post0.content, Person0.lastName, Tag0.name, Person0.firstName
from neo4j,Tag Tag0, TagClass TagClass0, Person Person0, Post Post0
where TagClass0.name = $param and neo4j.tid = Tag0.id and neo4j.tcid = TagClass0.id and neo4j.pid = Person0.id and neo4j.postid = Post0.id
##########
MATCH (m:Message2)-[:HAS_TAG]->(tag:Tag)<-[:HAS_TAG]-(:Message2)-[:HAS_CREATOR]->(creator:Person1)

RETURN creator.id as creatorid, tag.id as tagid, m.id as mid
**********
select Person0.lastName, Message0.content, Message0.creationDate, Person0.firstName
from neo4j,Tag Tag0, Message Message0, Person Person0
where Person0.birthday < $param and Tag0.name = $param and neo4j.tagid = Tag0.id and neo4j.mid = Message0.id and neo4j.creatorid = Person0.id
##########
MATCH (c:Comment2)-[:REPLY_OF*]->(p:Post2)<-[:CONTAINER_OF]-(f:Forum2)-[:HAS_MEMBER]->(person:Person1)

RETURN person.id as personid, c.id as cid, f.id as fid
**********
select Comment0.creationDate, Person0.lastName, Person0.firstName, Comment0.content
from neo4j,Forum Forum0, Comment Comment0, Person Person0
where Forum0.title = $param and Person0.gender = $param and neo4j.fid = Forum0.id and neo4j.cid = Comment0.id and neo4j.personid = Person0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)<-[:IS_SUBCLASS_OF*]-(subTc:TagClass)

RETURN subTc.id as subTcid, tc.id as tcid, p.id as pid, t.id as tid
**********
select TagClass1.name, Person0.lastName, Tag0.name, Person0.firstName
from neo4j,Person Person0, TagClass TagClass0, TagClass TagClass1, Tag Tag0
where TagClass1.name = $param and TagClass0.name = $param and neo4j.pid = Person0.id and neo4j.tcid = TagClass0.id and neo4j.subTcid = TagClass1.id and neo4j.tid = Tag0.id
##########
MATCH (msg:Message2)-[:HAS_CREATOR]->(p:Person1)-[:WORK_AT]->(comp:Company)-[:IS_LOCATED_IN]->(country:Country)

RETURN msg.id as msgid, country.id as countryid, comp.id as compid
**********
select Message0.content, Message0.creationDate, Country0.name, Company0.name
from neo4j,Message Message0, Company Company0, Country Country0
where Company0.name = $param and Message0.locationIP = $param and neo4j.msgid = Message0.id and neo4j.compid = Company0.id and neo4j.countryid = Country0.id
##########
MATCH (c:Comment1)-[:REPLY_OF]->(m:Message1)-[:HAS_CREATOR]->(creator:Person)-[:STUDY_AT]->(uni:University)

RETURN uni.id as uniid, creator.id as creatorid, c.id as cid
**********
select University0.name, Person0.firstName, Comment0.creationDate, Comment0.content, Person0.lastName
from neo4j,University University0, Comment Comment0, Person Person0
where University0.name = $param and Comment0.browserUsed = $param and neo4j.uniid = University0.id and neo4j.cid = Comment0.id and neo4j.creatorid = Person0.id
##########
MATCH (p:Person1)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(org:Organisation)

RETURN org.id as orgid, p.id as pid, city.id as cityid
**********
select Organisation0.name, Person0.email, Person0.lastName, Person0.firstName
from neo4j,City City0, Person Person0, Organisation Organisation0
where Organisation0.name = $param and City0.name = $param and neo4j.cityid = City0.id and neo4j.pid = Person0.id and neo4j.orgid = Organisation0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(m:Message1)-[:REPLY_OF]->(c:Comment1)-[:HAS_CREATOR]->(author:Person1)

RETURN author.id as authorid, c.id as cid, p.id as pid, m.id as mid
**********
select neo4j.mid, Comment0.content
from neo4j,Comment Comment0, Person Person0, Person Person1
where Person0.gender = $param and Person1.birthday > $param and neo4j.cid = Comment0.id and neo4j.pid = Person0.id and neo4j.authorid = Person1.id
##########
MATCH (t:Tag)<-[:HAS_TAG]-(p:Post2)<-[:CONTAINER_OF]-(f:Forum1)-[:HAS_MEMBER]->(person:Person1)

RETURN person.id as personid, org.id as orgid, city.id as cityid
**********
select Organisation0.name, City0.name, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Organisation Organisation0, City City0
where City0.name = $param and Person0.speaks CONTAINS $param and neo4j.personid = Person0.id and neo4j.orgid = Organisation0.id and neo4j.cityid = City0.id
##########
MATCH (p:Post2)-[:HAS_CREATOR]->(author:Person)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(m:Message2)

RETURN author.id as authorid, p.id as pid, tag.id as tagid, m.id as mid
**********
select neo4j.authorid, Message0.content
from neo4j,Post Post0, Tag Tag0, Message Message0
where Post0.creationDate < $param and Tag0.name = $param and neo4j.pid = Post0.id and neo4j.tagid = Tag0.id and neo4j.mid = Message0.id
##########
MATCH (forum:Forum1)-[:CONTAINER_OF]->(post:Post1)-[:HAS_CREATOR]->(creator:Person1)

RETURN creator.id as creatorid, post.id as postid, forum.id as forumid
**********
select neo4j.postid, Post0.content, Person0.lastName, Person0.firstName
from neo4j,Post Post0, Forum Forum0, Person Person0
where Person0.gender = $param and Forum0.title = $param and neo4j.postid = Post0.id and neo4j.forumid = Forum0.id and neo4j.creatorid = Person0.id
##########
MATCH (p:Person)-[:HAS_INTEREST]->(tag:Tag)-[:HAS_TYPE]->(tagClass:TagClass)<-[:IS_SUBCLASS_OF]-(subClass:TagClass)
RETURN tagClass.id as tagClassid, tag.id as tagid, subClass.id as subClassid, p.id as pid
**********
select Person0.firstName, Tag0.name, TagClass1.name, TagClass0.name, Person0.lastName
from neo4j,TagClass TagClass0, Person Person0, Tag Tag0, TagClass TagClass1
where TagClass1.name = $param and neo4j.subClassid = TagClass0.id and neo4j.pid = Person0.id and neo4j.tagid = Tag0.id and neo4j.tagClassid = TagClass1.id
##########
MATCH (p:Person1)-[:LIKES]->(msg:Message2)-[:REPLY_OF]->(orig:Post1)-[:HAS_CREATOR]->(creator:Person1)

RETURN uni.id as uniid, student.id as studentid, org.id as orgid, city.id as cityid
**********
select Person0.firstName, University0.name, Person0.lastName
from neo4j,Person Person0, University University0, Organisation Organisation0, City City0
where Organisation0.name = $param and City0.name = $param and neo4j.studentid = Person0.id and neo4j.uniid = University0.id and neo4j.orgid = Organisation0.id and neo4j.cityid = City0.id
##########
MATCH (f:Forum)-[:CONTAINER_OF]->(p:Post2)-[:HAS_CREATOR]->(creator:Person1)

RETURN creator.id as creatorid, p.id as pid, f.id as fid
**********
select Person0.firstName, Post0.content, Post0.creationDate, neo4j.pid, Person0.lastName
from neo4j,Forum Forum0, Post Post0, Person Person0
where Forum0.title = $param and Person0.gender = $param and neo4j.fid = Forum0.id and neo4j.pid = Post0.id and neo4j.creatorid = Person0.id
##########
MATCH (comment:Comment2)-[:REPLY_OF]->(post:Post1)-[:HAS_TAG]->(tag:Tag)

RETURN comment.id as commentid, post.id as postid, tag.id as tagid
**********
select neo4j.postid, neo4j.commentid, Comment0.content
from neo4j,Tag Tag0, Comment Comment0
where Comment0.creationDate > $param and Tag0.name = $param and neo4j.tagid = Tag0.id and neo4j.commentid = Comment0.id
##########
MATCH (company:Company)<-[:WORK_AT]-(p:Person)<-[:HAS_CREATOR]-(comment:Comment2)-[:REPLY_OF]->(m:Message2)

RETURN company.id as companyid, m.id as mid, comment.id as commentid, p.id as pid
**********
select neo4j.companyid, Company0.name, Person0.firstName, Comment0.content, neo4j.mid, Person0.lastName, neo4j.pid
from neo4j,Comment Comment0, Person Person0, Company Company0
where Company0.name = $param and Comment0.length > $param and neo4j.commentid = Comment0.id and neo4j.pid = Person0.id and neo4j.companyid = Company0.id
##########
MATCH (person:Person1)-[:LIKES]->(msg:Message1)-[:REPLY_OF]->(comment:Comment2)-[:HAS_CREATOR]->(creator:Person)

RETURN person.id as personid, creator.id as creatorid, comment.id as commentid, msg.id as msgid
**********
select Person0.lastName, neo4j.commentid, neo4j.msgid, Person0.firstName
from neo4j,Person Person0, Comment Comment0, Person Person1
where Person1.gender = $param and Comment0.creationDate < $param and neo4j.creatorid = Person0.id and neo4j.commentid = Comment0.id and neo4j.personid = Person1.id
##########
MATCH (u:University)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(o:Organisation)

RETURN o.id as oid, u.id as uid, city.id as cityid
**********
select City0.name, Organisation0.name, University0.name, neo4j.uid, neo4j.oid
from neo4j,University University0, City City0, Organisation Organisation0
where City0.name = $param and University0.name = $param and neo4j.uid = University0.id and neo4j.cityid = City0.id and neo4j.oid = Organisation0.id
##########
MATCH (p1:Person1)-[:KNOWS]->(p2:Person1)-[:LIKES]->(c:Comment2)-[:REPLY_OF]->(post:Post2)

RETURN p1.id as p1id, post.id as postid, p2.id as p2id, c.id as cid
**********
select Person1.firstName, Person1.lastName, Comment0.content, neo4j.p2id, neo4j.postid
from neo4j,Person Person0, Comment Comment0, Person Person1, Post Post0
where Post0.creationDate > datetime($param) and Person0.gender = $param and neo4j.p1id = Person0.id and neo4j.cid = Comment0.id and neo4j.p2id = Person1.id and neo4j.postid = Post0.id
##########
MATCH (person:Person1)-[:WORK_AT]->(company:Company)-[:IS_LOCATED_IN]->(country:Country)

RETURN t.id as tid, tc.id as tcid, p.id as pid
**********
select Person0.firstName, Tag0.name, TagClass0.name, Person0.lastName, neo4j.pid
from neo4j,TagClass TagClass0, Tag Tag0, Person Person0
where TagClass0.name = $param and Person0.gender = $param and neo4j.tcid = TagClass0.id and neo4j.tid = Tag0.id and neo4j.pid = Person0.id
##########
MATCH (t:Tag)<-[:HAS_TAG]-(m:Message2)-[:HAS_CREATOR]->(p:Person)

RETURN t.id as tid, m.id as mid, p.id as pid
**********
select Person0.firstName, Tag0.name, Message0.content, Message0.length, Person0.lastName, neo4j.pid
from neo4j,Tag Tag0, Message Message0, Person Person0
where Tag0.name = $param and Message0.length < $param and neo4j.tid = Tag0.id and neo4j.mid = Message0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(pl:Place)
WHERE pl.id = $param
RETURN org.id as orgid, pl.id as plid, p.id as pid
**********
select Organisation0.name, Place0.name, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Organisation Organisation0, Place Place0
where Organisation0.name = $param and neo4j.pid = Person0.id and neo4j.orgid = Organisation0.id and neo4j.plid = Place0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(p:Person)-[:KNOWS]->(friend:Person)

RETURN u.id as uid, c.id as cid, p.id as pid
**********
select University0.name, Person0.lastName, City0.name, Person0.firstName
from neo4j,City City0, Person Person0, University University0
where Person0.birthday > $param and City0.name = $param and neo4j.cid = City0.id and neo4j.pid = Person0.id and neo4j.uid = University0.id
##########
MATCH (f:Forum)-[:CONTAINER_OF]->(po:Post1)-[:HAS_TAG]->(t:Tag)

RETURN po.id as poid, f.id as fid, t.id as tid
**********
select neo4j.poid, Tag0.name, neo4j.fid, Forum0.title, Post0.content
from neo4j,Tag Tag0, Post Post0, Forum Forum0
where Tag0.name = $param and Forum0.creationDate > $param and neo4j.tid = Tag0.id and neo4j.poid = Post0.id and neo4j.fid = Forum0.id
##########
MATCH (f:Forum2)-[:HAS_MEMBER]->(p:Person1)-[:STUDY_AT]->(u:University)

RETURN u.id as uid, p.id as pid, f.id as fid
**********
select Person0.firstName, University0.name, neo4j.fid, Forum0.title, Person0.lastName, neo4j.pid
from neo4j,University University0, Person Person0, Forum Forum0
where Forum0.title = $param and University0.name = $param and neo4j.uid = University0.id and neo4j.pid = Person0.id and neo4j.fid = Forum0.id
##########
MATCH (c:Comment1)-[:REPLY_OF]->(m:Message2)-[:HAS_CREATOR]->(p:Person)

RETURN m.id as mid, c.id as cid, p.id as pid
**********
select neo4j.cid, Comment0.creationDate, Comment0.content, Person0.firstName, neo4j.mid, Message0.content, Person0.lastName, neo4j.pid
from neo4j,Comment Comment0, Message Message0, Person Person0
where Person0.locationIP = $param and Comment0.length > $param and neo4j.cid = Comment0.id and neo4j.mid = Message0.id and neo4j.pid = Person0.id
##########
MATCH (comment:Comment1)-[:REPLY_OF]->(post:Post1)-[:HAS_CREATOR]->(creator:Person1)-[:WORK_AT]->(org:Organisation)

RETURN org.id as orgid, creator.id as creatorid, comment.id as commentid, post.id as postid
**********
select Organisation0.name, Person0.firstName, Comment0.content, Post0.content, Person0.lastName
from neo4j,Person Person0, Post Post0, Organisation Organisation0, Comment Comment0
where Comment0.creationDate > $param and Organisation0.name = $param and neo4j.creatorid = Person0.id and neo4j.postid = Post0.id and neo4j.orgid = Organisation0.id and neo4j.commentid = Comment0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(msg:Message2)-[:HAS_CREATOR]->(creator:Person)

RETURN t.id as tid, creator.id as creatorid, msg.id as msgid, p.id as pid
**********
select Person0.firstName, Message0.content, Person1.firstName, Tag0.name, Person1.lastName, Person0.lastName
from neo4j,Message Message0, Person Person0, Tag Tag0, Person Person1
where Person1.locationIP = $param and Message0.length < $param and neo4j.msgid = Message0.id and neo4j.creatorid = Person0.id and neo4j.tid = Tag0.id and neo4j.pid = Person1.id
##########
MATCH (p:Person1)-[:IS_LOCATED_IN]->(pl:Place)-[:IS_PART_OF]->(co:Country)

RETURN pl.id as plid, p.id as pid, co.id as coid
**********
select Person0.firstName, Place0.name, Person0.lastName, neo4j.pid, Country0.name
from neo4j,Country Country0, Person Person0, Place Place0
where Place0.name = $param and Country0.name = $param and neo4j.coid = Country0.id and neo4j.pid = Person0.id and neo4j.plid = Place0.id
##########
MATCH (p:Person)-[:LIKES]->(m:Message2)-[:HAS_TAG]->(t:Tag)

RETURN t.id as tid, m.id as mid, p.id as pid
**********
select Person0.firstName, Tag0.name, neo4j.mid, Message0.content, Person0.lastName, neo4j.pid
from neo4j,Tag Tag0, Message Message0, Person Person0
where Tag0.name = $param and Message0.creationDate < $param and neo4j.tid = Tag0.id and neo4j.mid = Message0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person1)-[:LIKES]->(c:Comment2)-[:REPLY_OF]->(m:Message1)-[:HAS_CREATOR]->(creator:Person)

RETURN m.id as mid, creator.id as creatorid, c.id as cid, p.id as pid
**********
select Person1.firstName, Comment0.content, Person0.firstName, Message0.content, Person0.lastName, Person1.lastName
from neo4j,Comment Comment0, Person Person0, Person Person1, Message Message0
where Person0.browserUsed = $param and Message0.creationDate > $param and neo4j.cid = Comment0.id and neo4j.pid = Person0.id and neo4j.creatorid = Person1.id and neo4j.mid = Message0.id
##########
MATCH (c:City)<-[:IS_LOCATED_IN]-(org:Organisation)<-[:WORK_AT]-(p:Person)-[:HAS_INTEREST]->(t:Tag)

RETURN org.id as orgid, c.id as cid, p.id as pid, t.id as tid
**********
select Organisation0.name, Person0.lastName, City0.name, Person0.firstName
from neo4j,Person Person0, City City0, Tag Tag0, Organisation Organisation0
where Tag0.name = $param and Organisation0.name = $param and neo4j.pid = Person0.id and neo4j.cid = City0.id and neo4j.tid = Tag0.id and neo4j.orgid = Organisation0.id
##########
MATCH (p:Person)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message1)<-[:CONTAINER_OF]-(f:Forum)-[:HAS_MODERATOR]->(mod:Person1)

RETURN mod.id as modid, m.id as mid, p.id as pid, f.id as fid, t.id as tid
**********
select Person0.lastName, Person1.firstName, Tag0.name, Person0.firstName, Forum0.title, Message0.content, Person1.lastName
from neo4j,Person Person0, Tag Tag0, Person Person1, Message Message0, Forum Forum0
where Forum0.title = $param and Person1.locationIP = $param and neo4j.modid = Person0.id and neo4j.tid = Tag0.id and neo4j.pid = Person1.id and neo4j.mid = Message0.id and neo4j.fid = Forum0.id
##########
MATCH (f:Forum1)-[:CONTAINER_OF]->(p:Post1)-[:HAS_CREATOR]->(person:Person)-[:STUDY_AT]->(u:University), (p)-[:HAS_TAG]->(t:Tag)

RETURN person.id as personid, u.id as uid, p.id as pid, f.id as fid, t.id as tid
**********
select Post0.content, University0.name, Person0.lastName, Tag0.name, Person0.firstName, Forum0.title
from neo4j,Post Post0, Person Person0, Tag Tag0, University University0, Forum Forum0
where Tag0.name = $param and Person0.gender = $param and neo4j.pid = Post0.id and neo4j.personid = Person0.id and neo4j.tid = Tag0.id and neo4j.uid = University0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(city:City)-[:IS_PART_OF]->(country:Country)

RETURN u.id as uid, country.id as countryid, p.id as pid, city.id as cityid
**********
select City0.name, Person0.firstName, University0.name, Country0.name, Person0.lastName
from neo4j,Country Country0, Person Person0, City City0, University University0
where Country0.name = $param and Person0.speaks = $param and neo4j.countryid = Country0.id and neo4j.pid = Person0.id and neo4j.cityid = City0.id and neo4j.uid = University0.id
##########
MATCH (p:Person1)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(city:City)

RETURN u.id as uid, p.id as pid, city.id as cityid
**********
select City0.name, University0.name, Person0.lastName, Person0.firstName
from neo4j,University University0, Person Person0, City City0
where Person0.birthday < $param and City0.name = $param and neo4j.uid = University0.id and neo4j.pid = Person0.id and neo4j.cityid = City0.id
##########
MATCH (person:Person1)-[:LIKES]->(post:Post2)-[:HAS_CREATOR]->(creator:Person)-[:WORK_AT]->(organisation:Organisation)-[:IS_LOCATED_IN]->(place:Place)

RETURN person.id as personid, creator.id as creatorid, place.id as placeid, post.id as postid, organisation.id as organisationid
**********
select Post0.content, Person0.lastName, Place0.name, Person0.firstName
from neo4j,Person Person0, Post Post0, Place Place0, Organisation Organisation0, Person Person1
where Person1.firstName = $param and Organisation0.name = $param and neo4j.creatorid = Person0.id and neo4j.postid = Post0.id and neo4j.placeid = Place0.id and neo4j.organisationid = Organisation0.id and neo4j.personid = Person1.id
##########
MATCH (university:University)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(person:Person1)-[:HAS_INTEREST]->(tag:Tag)

RETURN university.id as universityid, person.id as personid, tag.id as tagid, city.id as cityid
**********
select City0.name, Person0.lastName, University0.name, Person0.firstName
from neo4j,University University0, City City0, Person Person0, Tag Tag0
where Person0.birthday < $param and Tag0.name = $param and neo4j.universityid = University0.id and neo4j.cityid = City0.id and neo4j.personid = Person0.id and neo4j.tagid = Tag0.id
##########
MATCH (m:Message2)-[:REPLY_OF]->(p:Post1)-[:HAS_CREATOR]->(c:Person)-[:WORK_AT]->(o:Company)

RETURN o.id as oid, m.id as mid, p.id as pid, c.id as cid
**********
select Company0.name, neo4j.cid, Person0.firstName, Post0.content, neo4j.mid, Message0.content, neo4j.oid, Person0.lastName, neo4j.pid
from neo4j,Company Company0, Message Message0, Post Post0, Person Person0
where Company0.name = $param and Message0.creationDate > $param and neo4j.oid = Company0.id and neo4j.mid = Message0.id and neo4j.pid = Post0.id and neo4j.cid = Person0.id
##########
MATCH (c1:Comment1)-[:REPLY_OF]->(c2:Comment1)-[:HAS_CREATOR]->(p:Person1)-[:HAS_INTEREST]->(t:Tag)

RETURN t.id as tid, c2.id as c2id, c1.id as c1id, p.id as pid
**********
select neo4j.c2id, Comment0.content, Comment1.content, Person0.firstName, neo4j.tid, neo4j.c1id, Tag0.name, Person0.lastName, neo4j.pid
from neo4j,Comment Comment0, Tag Tag0, Person Person0, Comment Comment1
where Comment0.creationDate > $param and Tag0.name = $param and neo4j.c1id = Comment0.id and neo4j.tid = Tag0.id and neo4j.pid = Person0.id and neo4j.c2id = Comment1.id
##########
MATCH (tagClass:TagClass)<-[:HAS_TYPE]-(tag:Tag)<-[:HAS_TAG]-(message:Message1)<-[:REPLY_OF]-(comment:Comment2)-[:HAS_CREATOR]->(creator:Person)

RETURN message.id as messageid, tagClass.id as tagClassid, creator.id as creatorid, comment.id as commentid, tag.id as tagid
**********
select Person0.firstName, Comment0.content, Tag0.name, Message0.content, Person0.lastName
from neo4j,Person Person0, Message Message0, Tag Tag0, TagClass TagClass0, Comment Comment0
where Comment0.creationDate > $param and TagClass0.name = $param and neo4j.creatorid = Person0.id and neo4j.messageid = Message0.id and neo4j.tagid = Tag0.id and neo4j.tagClassid = TagClass0.id and neo4j.commentid = Comment0.id
##########
MATCH (p1:Person1)-[:KNOWS]->(p2:Person)-[:LIKES]->(post:Post1)-[:HAS_CREATOR]->(p3:Person)

RETURN p3.id as p3id, p1.id as p1id, post.id as postid, p2.id as p2id
**********
select Person2.firstName, Person0.lastName, Person1.lastName, Person1.firstName, Person2.lastName, neo4j.p3id, neo4j.p2id, neo4j.postid, Post0.content, Person0.firstName, neo4j.p1id
from neo4j,Person Person0, Person Person1, Post Post0, Person Person2
where Person1.birthday > $param and Person0.gender = $param and neo4j.p1id = Person0.id and neo4j.p3id = Person1.id and neo4j.postid = Post0.id and neo4j.p2id = Person2.id
##########
MATCH (person:Person1)-[:KNOWS]->(friend:Person)-[:STUDY_AT]->(university:University)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(organisation:Organisation)

RETURN university.id as universityid, friend.id as friendid, person.id as personid, city.id as cityid, organisation.id as organisationid
**********
select Organisation0.name, Person1.firstName, Person1.lastName, University0.name
from neo4j,Person Person0, University University0, City City0, Person Person1, Organisation Organisation0
where Person0.email = $param and City0.name = $param and neo4j.personid = Person0.id and neo4j.universityid = University0.id and neo4j.cityid = City0.id and neo4j.friendid = Person1.id and neo4j.organisationid = Organisation0.id
##########
MATCH (forum:Forum)-[:CONTAINER_OF]->(message:Message2)-[:HAS_TAG]->(tag:Tag)<-[:HAS_INTEREST]-(person:Person)

RETURN message.id as messageid, person.id as personid, forum.id as forumid, tag.id as tagid
**********
select Tag0.name, Message0.content, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Tag Tag0, Message Message0, Forum Forum0
where Message0.creationDate < $param and Forum0.title = $param and neo4j.personid = Person0.id and neo4j.tagid = Tag0.id and neo4j.messageid = Message0.id and neo4j.forumid = Forum0.id
##########
MATCH (c:City)<-[:IS_LOCATED_IN]-(org:Organisation)<-[:WORK_AT]-(p:Person1)-[:KNOWS]-(friend:Person)

