RETURN friend.id as friendid, org.id as orgid, c.id as cid, p.id as pid
**********
select Organisation0.name, City0.name, Person0.lastName, Person1.firstName, Person0.firstName, Person1.lastName
from neo4j,City City0, Person Person0, Organisation Organisation0, Person Person1
where Person0.email CONTAINS $param and City0.name = $param and neo4j.cid = City0.id and neo4j.friendid = Person0.id and neo4j.orgid = Organisation0.id and neo4j.pid = Person1.id
##########
MATCH (f:Forum2)-[:CONTAINER_OF]->(post:Post2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN post.id as postid, tc.id as tcid, f.id as fid, t.id as tid
**********
select Forum0.title, Post0.content, Tag0.name
from neo4j,TagClass TagClass0, Forum Forum0, Post Post0, Tag Tag0
where TagClass0.name = $param and Forum0.creationDate < $param and neo4j.tcid = TagClass0.id and neo4j.fid = Forum0.id and neo4j.postid = Post0.id and neo4j.tid = Tag0.id
##########
MATCH (person:Person)-[:HAS_CREATOR]-(msg:Message1)-[:REPLY_OF]->(comment:Comment2)-[:HAS_CREATOR]->(otherPerson:Person1)

RETURN tc2.id as tc2id, tc.id as tcid, p.id as pid, t.id as tid
**********
select TagClass0.name, Person0.lastName, Tag0.name, Person0.firstName
from neo4j,Person Person0, TagClass TagClass0, TagClass TagClass1, Tag Tag0
where Person0.browserUsed = $param and TagClass1.name = $param and neo4j.pid = Person0.id and neo4j.tcid = TagClass0.id and neo4j.tc2id = TagClass1.id and neo4j.tid = Tag0.id
##########
MATCH (person:Person1)-[:LIKES]->(message:Message2)-[:HAS_CREATOR]->(creator:Person1)-[:IS_LOCATED_IN]->(city:City)

RETURN message.id as messageid, person.id as personid, creator.id as creatorid, city.id as cityid
**********
select Person1.firstName, Person0.lastName, Person0.firstName, Message0.content, Person1.lastName
from neo4j,Person Person0, City City0, Person Person1, Message Message0
where Person0.locationIP = $param and City0.name = $param and neo4j.personid = Person0.id and neo4j.cityid = City0.id and neo4j.creatorid = Person1.id and neo4j.messageid = Message0.id
##########
MATCH (msg:Message2)-[:HAS_TAG]->(tag:Tag)-[:HAS_TYPE]->(tagClass:TagClass)<-[:IS_SUBCLASS_OF]-(superClass:TagClass)

RETURN tagClass.id as tagClassid, superClass.id as superClassid, msg.id as msgid, tag.id as tagid
**********
select Message0.content, Tag0.name, TagClass1.name
from neo4j,Tag Tag0, TagClass TagClass0, Message Message0, TagClass TagClass1
where TagClass0.name = $param and TagClass1.name = $param and neo4j.tagid = Tag0.id and neo4j.superClassid = TagClass0.id and neo4j.msgid = Message0.id and neo4j.tagClassid = TagClass1.id
##########
MATCH (p:Person1)-[:LIKES]->(m:Message1)-[:HAS_TAG]->(t:Tag)

RETURN u.id as uid, country.id as countryid, p.id as pid, city.id as cityid
**********
select City0.name, Person0.firstName, University0.name, Country0.name, neo4j.uid, neo4j.cityid, neo4j.countryid, Person0.lastName, neo4j.pid
from neo4j,Person Person0, City City0, Country Country0, University University0
where Country0.name = $param and University0.name = $param and neo4j.pid = Person0.id and neo4j.cityid = City0.id and neo4j.countryid = Country0.id and neo4j.uid = University0.id
##########
MATCH (f:Forum2)-[:CONTAINER_OF]->(p:Post2)-[:HAS_CREATOR]->(person:Person)

RETURN person.id as personid, p.id as pid, f.id as fid
**********
select Forum0.title, Person0.firstName, Person0.lastName, Post0.content
from neo4j,Forum Forum0, Person Person0, Post Post0
where Forum0.title = $param and Person0.birthday > $param and neo4j.fid = Forum0.id and neo4j.personid = Person0.id and neo4j.pid = Post0.id
##########
MATCH (c:Comment2)-[:REPLY_OF*]->(m:Message2)-[:HAS_TAG]->(t:Tag)

RETURN m.id as mid, c.id as cid, t.id as tid
**********
select Message0.content, Tag0.name, Comment0.content
from neo4j,Message Message0, Comment Comment0, Tag Tag0
where Tag0.name = $param and Comment0.creationDate > $param and neo4j.mid = Message0.id and neo4j.cid = Comment0.id and neo4j.tid = Tag0.id
##########
MATCH (f:Forum1)-[:HAS_MODERATOR]->(moderator:Person)-[:WORK_AT]->(comp:Company)
WHERE moderator.creationDate < $param
RETURN moderator.id as moderatorid, f.id as fid, comp.id as compid
**********
select Forum0.title, Person0.firstName, Company0.name
from neo4j,Company Company0, Person Person0, Forum Forum0
where Forum0.title = $param and neo4j.compid = Company0.id and neo4j.moderatorid = Person0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(msg:Message2)<-[:CONTAINER_OF]-(f:Forum1)

RETURN msg.id as msgid, p.id as pid, f.id as fid
**********
select Message0.content, Forum0.title, Person0.lastName, Person0.firstName
from neo4j,Forum Forum0, Person Person0, Message Message0
where Forum0.title = $param and Person0.gender = $param and neo4j.fid = Forum0.id and neo4j.pid = Person0.id and neo4j.msgid = Message0.id
##########
MATCH (comment:Comment1)-[:REPLY_OF]->(msg:Message2)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_PART_OF]-(country:Country)

RETURN place.id as placeid, comment.id as commentid, msg.id as msgid, country.id as countryid
**********
select Message0.content, Comment0.content, neo4j.commentid, Country0.name, Place0.name, neo4j.countryid, neo4j.msgid, neo4j.placeid
from neo4j,Message Message0, Place Place0, Country Country0, Comment Comment0
where Country0.name = $param and Place0.name = $param and neo4j.msgid = Message0.id and neo4j.placeid = Place0.id and neo4j.countryid = Country0.id and neo4j.commentid = Comment0.id
##########
MATCH (m:Message2)-[:IS_LOCATED_IN]->(place:Place)-[:IS_PART_OF]->(country:Country)

RETURN place.id as placeid, country.id as countryid, m.id as mid
**********
select Country0.name, Message0.content, Place0.name, Message0.creationDate
from neo4j,Country Country0, Message Message0, Place Place0
where Country0.name = $param and Message0.browserUsed = $param and neo4j.countryid = Country0.id and neo4j.mid = Message0.id and neo4j.placeid = Place0.id
##########
MATCH (m:Message1)-[:HAS_CREATOR]->(p:Person)-[:WORK_AT]->(c:Company)

RETURN u.id as uid, p.id as pid, city.id as cityid
**********
select City0.name, University0.name, Person0.lastName, Person0.firstName
from neo4j,University University0, Person Person0, City City0
where Person0.birthday > $param and City0.name = $param and neo4j.uid = University0.id and neo4j.pid = Person0.id and neo4j.cityid = City0.id
##########
MATCH (org:Organisation)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(p:Person1)

RETURN org.id as orgid, country.id as countryid, city.id as cityid
**********
select Organisation0.name, City0.name, Country0.name
from neo4j,Country Country0, City City0, Organisation Organisation0
where Country0.name = $param and Organisation0.name = $param and neo4j.countryid = Country0.id and neo4j.cityid = City0.id and neo4j.orgid = Organisation0.id
##########
MATCH (msg:Message1)-[:REPLY_OF*1..3]->(post:Post2)-[:HAS_CREATOR]->(author:Person)-[:IS_LOCATED_IN]->(place:Place)

RETURN author.id as authorid, place.id as placeid, post.id as postid, msg.id as msgid
**********
select Message0.content, Person0.firstName, Person0.lastName, neo4j.postid, neo4j.msgid
from neo4j,Person Person0, Place Place0, Message Message0
where Message0.length > $param and Place0.name = $param and neo4j.authorid = Person0.id and neo4j.placeid = Place0.id and neo4j.msgid = Message0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(o:Organisation)-[:IS_LOCATED_IN]->(c:City)

RETURN o.id as oid, c.id as cid, p.id as pid
**********
select Organisation0.name, City0.name, Person0.firstName, Person0.lastName, neo4j.pid
from neo4j,Person Person0, City City0, Organisation Organisation0
where Person0.firstName = $param and City0.name = $param and neo4j.pid = Person0.id and neo4j.cid = City0.id and neo4j.oid = Organisation0.id
##########
MATCH (f:Forum)-[:CONTAINER_OF]->(post:Post1)-[:HAS_TAG]->(t:Tag)

RETURN post.id as postid, f.id as fid, t.id as tid
**********
select neo4j.postid, Tag0.name, neo4j.fid, Forum0.title, Post0.content
from neo4j,Post Post0, Forum Forum0, Tag Tag0
where Tag0.name = $param and Forum0.creationDate > $param and neo4j.postid = Post0.id and neo4j.fid = Forum0.id and neo4j.tid = Tag0.id
##########
MATCH (f:Forum)-[:CONTAINER_OF]->(m:Message2)-[:HAS_CREATOR]->(p:Person1)-[:IS_LOCATED_IN]->(place:Place)

RETURN place.id as placeid, p.id as pid, f.id as fid, m.id as mid
**********
select Forum0.title, Message0.content, Place0.name, Person0.firstName
from neo4j,Message Message0, Place Place0, Forum Forum0, Person Person0
where Forum0.title = $param and Message0.length > $param and neo4j.mid = Message0.id and neo4j.placeid = Place0.id and neo4j.fid = Forum0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person)-[:HAS_CREATOR]-(m:Message2)-[:IS_LOCATED_IN]->(country:Country)

RETURN m.id as mid, country.id as countryid, p.id as pid
**********
select Person0.firstName, Country0.name, neo4j.mid, Message0.content, neo4j.pid
from neo4j,Country Country0, Message Message0, Person Person0
where Country0.name = $param and Person0.browserUsed = $param and neo4j.countryid = Country0.id and neo4j.mid = Message0.id and neo4j.pid = Person0.id
##########
MATCH (company:Company)<-[:WORK_AT]-(p:Person1)-[:HAS_INTEREST]->(t:Tag)

RETURN t.id as tid, company.id as companyid, p.id as pid
**********
select neo4j.companyid, Company0.name, Person0.firstName, Tag0.name, neo4j.pid
from neo4j,Tag Tag0, Person Person0, Company Company0
where Tag0.name = $param and Company0.name = $param and neo4j.tid = Tag0.id and neo4j.pid = Person0.id and neo4j.companyid = Company0.id
##########
MATCH (u:University)<-[:STUDY_AT]-(p:Person)-[:IS_LOCATED_IN]->(c:City)

RETURN u.id as uid, c.id as cid, p.id as pid
**********
select City0.name, Person0.firstName, University0.name, neo4j.uid, neo4j.pid
from neo4j,University University0, Person Person0, City City0
where City0.name = $param and University0.name = $param and neo4j.uid = University0.id and neo4j.pid = Person0.id and neo4j.cid = City0.id
##########
MATCH (p1:Person)-[:KNOWS]->(p2:Person)-[:LIKES]->(msg:Message1)<-[:REPLY_OF]-(comment:Comment1)

RETURN comment.id as commentid, p1.id as p1id, p2.id as p2id, msg.id as msgid
**********
select Message0.content, Person0.firstName, Person0.lastName, Comment0.content
from neo4j,Message Message0, Person Person0, Comment Comment0, Person Person1
where Person1.email = $param and Comment0.creationDate < $param and neo4j.msgid = Message0.id and neo4j.p2id = Person0.id and neo4j.commentid = Comment0.id and neo4j.p1id = Person1.id
##########
MATCH (p:Person)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(c:City)<-[:IS_LOCATED_IN]-(o:Organisation)

RETURN o.id as oid, u.id as uid, c.id as cid, p.id as pid
**********
select Organisation0.name, City0.name, Person0.firstName, University0.name, Person0.lastName
from neo4j,Organisation Organisation0, City City0, Person Person0, University University0
where Person0.birthday > $param and City0.name = $param and neo4j.oid = Organisation0.id and neo4j.cid = City0.id and neo4j.pid = Person0.id and neo4j.uid = University0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(p:Person2)-[:HAS_INTEREST]->(tag:Tag)

RETURN p.id as pid, tag.id as tagid, f.id as fid
**********
select Forum0.title, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Tag Tag0, Forum Forum0
where Forum0.title = $param and Tag0.name = $param and neo4j.pid = Person0.id and neo4j.tagid = Tag0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(msg:Message3)-[:IS_LOCATED_IN]->(place:Place)

RETURN place.id as placeid, msg.id as msgid, p.id as pid, tag.id as tagid
**********
select Message0.content, Tag0.name, Place0.name, Person0.firstName
from neo4j,Person Person0, Place Place0, Message Message0, Tag Tag0
where Place0.name = $param and Message0.locationIP = $param and neo4j.pid = Person0.id and neo4j.placeid = Place0.id and neo4j.msgid = Message0.id and neo4j.tagid = Tag0.id
##########
MATCH (p:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)

RETURN t.id as tid, p.id as pid, m.id as mid
**********
select Message0.content, Person0.lastName, Tag0.name, Person0.firstName
from neo4j,Message Message0, Person Person0, Tag Tag0
where Person0.locationIP = $param and Message0.length < $param and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.tid = Tag0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)-[:HAS_CREATOR]->(creator:Person2)

RETURN t.id as tid, creator.id as creatorid, p.id as pid, m.id as mid
**********
select Message0.content, Person0.lastName, Tag0.name, Person0.firstName
from neo4j,Person Person0, Message Message0, Tag Tag0, Person Person1
where Person1.gender = $param and Message0.length > $param and neo4j.pid = Person0.id and neo4j.mid = Message0.id and neo4j.tid = Tag0.id and neo4j.creatorid = Person1.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person2)-[:HAS_INTEREST]->(t:Tag)

RETURN friend.id as friendid, p.id as pid, t.id as tid
**********
select Person0.lastName, Person1.firstName, Person0.firstName, Tag0.name, Person1.lastName
from neo4j,Person Person0, Tag Tag0, Person Person1
where Tag0.name = $param and Person1.browserUsed = $param and neo4j.friendid = Person0.id and neo4j.tid = Tag0.id and neo4j.pid = Person1.id
##########
MATCH (p:Person2)-[:KNOWS]->(friend:Person1)-[:HAS_INTEREST]->(t:Tag)

RETURN friend.id as friendid, p.id as pid, t.id as tid
**********
select Person0.lastName, Person1.firstName, Person0.firstName, Tag0.name, Person1.lastName
from neo4j,Person Person0, Person Person1, Tag Tag0
where Tag0.name = $param and Person1.gender = $param and neo4j.friendid = Person0.id and neo4j.pid = Person1.id and neo4j.tid = Tag0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(post:Post3)-[:HAS_CREATOR]->(creator:Person3)
WHERE p.id = $param
RETURN creator.id as creatorid, post.id as postid, p.id as pid
**********
select neo4j.creatorid, Person0.firstName, Person1.firstName, neo4j.postid, Post0.content, neo4j.pid
from neo4j,Person Person0, Post Post0, Person Person1
where Post0.creationDate > $param and neo4j.creatorid = Person0.id and neo4j.postid = Post0.id and neo4j.pid = Person1.id
##########
MATCH (p:Person3)-[:KNOWS*1..3]-(friend:Person3)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)

RETURN m.id as mid, p.id as pid, t.id as tid
**********
select Message0.content, Person0.lastName, Message0.creationDate, Person0.firstName
from neo4j,Message Message0, Tag Tag0, Person Person0
where Tag0.name = $param and Person0.gender = $param and neo4j.mid = Message0.id and neo4j.tid = Tag0.id and neo4j.pid = Person0.id
##########
MATCH (forum:Forum1)-[:HAS_MEMBER]->(member:Person1)-[:WORK_AT]->(company:Company)

RETURN member.id as memberid, forum.id as forumid, company.id as companyid
**********
select Forum0.title, Person0.lastName, Company0.name, Person0.firstName
from neo4j,Person Person0, Company Company0, Forum Forum0
where Person0.locationIP = $param and Forum0.title = $param and Company0.name = $param and neo4j.memberid = Person0.id and neo4j.companyid = Company0.id and neo4j.forumid = Forum0.id
##########
MATCH (p:Person3)-[:KNOWS*2..3]-(friend:Person3)-[:LIKES]->(m:Message3)

RETURN friend.id as friendid, m.id as mid, p.id as pid
**********
select Person1.firstName, Person0.firstName, neo4j.friendid, Message0.content, neo4j.mid, neo4j.pid
from neo4j,Person Person0, Message Message0, Person Person1
where Person1.birthday < $param and Message0.locationIP = $param and neo4j.friendid = Person0.id and neo4j.mid = Message0.id and neo4j.pid = Person1.id
##########
MATCH (p:Person2)-[:KNOWS]->(friend:Person1)-[:HAS_INTEREST]->(tag:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN friend.id as friendid, tc.id as tcid, p.id as pid, tag.id as tagid
**********
select Tag0.name, Person1.firstName, Person1.lastName
from neo4j,Person Person0, TagClass TagClass0, Tag Tag0, Person Person1
where TagClass0.name = $param and Person0.speaks = $param and neo4j.pid = Person0.id and neo4j.tcid = TagClass0.id and neo4j.tagid = Tag0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person1)-[:WORK_AT]->(comp:Company)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_LOCATED_IN]-(msg:Message3)

RETURN comp.id as compid, place.id as placeid, msg.id as msgid, p.id as pid
**********
select Message0.content, Person0.firstName, Place0.name, Person0.lastName, Company0.name, neo4j.pid
from neo4j,Message Message0, Place Place0, Company Company0, Person Person0
where Person0.firstName = $param and Message0.creationDate > date($param) and neo4j.msgid = Message0.id and neo4j.placeid = Place0.id and neo4j.compid = Company0.id and neo4j.pid = Person0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)

RETURN t.id as tid, p.id as pid, f.id as fid, m.id as mid
**********
select Person0.firstName, Tag0.name, Forum0.title, Message0.content, Person0.lastName
from neo4j,Forum Forum0, Person Person0, Tag Tag0, Message Message0
where Forum0.title = $param and Message0.length > $param and neo4j.fid = Forum0.id and neo4j.pid = Person0.id and neo4j.tid = Tag0.id and neo4j.mid = Message0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(f:Forum1)-[:HAS_MODERATOR]->(mod:Person2)

RETURN mod.id as modid, p.id as pid, f.id as fid, t.id as tid
**********
select Person0.lastName, Person1.firstName, Person0.firstName, Forum0.title, Person1.lastName
from neo4j,Person Person0, Person Person1, Tag Tag0, Forum Forum0
where Tag0.name = $param and Person0.gender = $param and neo4j.modid = Person0.id and neo4j.pid = Person1.id and neo4j.tid = Tag0.id and neo4j.fid = Forum0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(p:Person1)-[:KNOWS]->(friend:Person1)

RETURN friend.id as friendid, p.id as pid, f.id as fid
**********
select Person0.lastName, Person1.firstName, Person0.firstName, Forum0.title, Person1.lastName
from neo4j,Forum Forum0, Person Person0, Person Person1
where Forum0.title = $param and Person0.birthday > $param and neo4j.fid = Forum0.id and neo4j.friendid = Person0.id and neo4j.pid = Person1.id
##########
MATCH (p:Person2)-[:WORK_AT]->(c:Company)-[:IS_LOCATED_IN]->(country:Country)<-[:IS_LOCATED_IN]-(msg:Message3)

RETURN msg.id as msgid, country.id as countryid, c.id as cid, p.id as pid
**********
select Message0.content, Country0.name, Person0.lastName, Person0.firstName
from neo4j,Country Country0, Person Person0, Message Message0, Company Company0
where Message0.browserUsed = $param and Company0.name = $param and neo4j.countryid = Country0.id and neo4j.pid = Person0.id and neo4j.msgid = Message0.id and neo4j.cid = Company0.id
##########
MATCH (p:Person2)-[:KNOWS]->(p2:Person1)-[:HAS_INTEREST]->(t:Tag)

RETURN p2.id as p2id, p.id as pid, t.id as tid
**********
select Person0.firstName, Person0.lastName, Person1.firstName, Tag0.name, Person1.lastName
from neo4j,Tag Tag0, Person Person0, Person Person1
where Tag0.name = $param and Person0.birthday > $param and neo4j.tid = Tag0.id and neo4j.p2id = Person0.id and neo4j.pid = Person1.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(p:Person1)-[:KNOWS]->(p2:Person2)
WHERE p.creationDate > date($param)
RETURN p2.id as p2id, p.id as pid, f.id as fid
**********
select Forum0.title, Person1.firstName, Person0.firstName
from neo4j,Forum Forum0, Person Person0, Person Person1
where Forum0.title = $param and neo4j.fid = Forum0.id and neo4j.pid = Person0.id and neo4j.p2id = Person1.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(member:Person3)-[:LIKES]->(likedMessage:Message3)-[:HAS_TAG]->(tag:Tag)

RETURN member.id as memberid, likedMessage.id as likedMessageid, tag.id as tagid, f.id as fid
**********
select Message0.content, Forum0.title, Person0.firstName
from neo4j,Person Person0, Forum Forum0, Tag Tag0, Message Message0
where Forum0.creationDate > $param and Tag0.name = $param and neo4j.memberid = Person0.id and neo4j.fid = Forum0.id and neo4j.tagid = Tag0.id and neo4j.likedMessageid = Message0.id
##########
MATCH (p1:Person2)-[:KNOWS]->(p2:Person1)-[:KNOWS]->(p3:Person2)

RETURN p3.id as p3id, p1.id as p1id, p2.id as p2id
**********
select Person2.firstName, Person1.firstName, Person0.firstName
from neo4j,Person Person0, Person Person1, Person Person2
where Person2.gender = $param and Person0.birthday < $param and neo4j.p1id = Person0.id and neo4j.p2id = Person1.id and neo4j.p3id = Person2.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(post:Post3)

RETURN friend.id as friendid, post.id as postid, p.id as pid, t.id as tid
**********
select Post0.content, Person1.lastName, Person0.firstName, Person1.firstName, Tag0.name, Person0.lastName
from neo4j,Person Person0, Person Person1, Tag Tag0, Post Post0
where Post0.creationDate > $param and Person0.email = $param and neo4j.pid = Person0.id and neo4j.friendid = Person1.id and neo4j.tid = Tag0.id and neo4j.postid = Post0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(c:Company)-[:IS_LOCATED_IN]->(country:Country)<-[:IS_LOCATED_IN]-(msg:Message3)

RETURN c.id as cid, msg.id as msgid, country.id as countryid, p.id as pid
**********
select Message0.content, Person0.lastName, Company0.name, Person0.firstName
from neo4j,Person Person0, Message Message0, Country Country0, Company Company0
where Country0.name = $param and Person0.gender = $param and neo4j.pid = Person0.id and neo4j.msgid = Message0.id and neo4j.countryid = Country0.id and neo4j.cid = Company0.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(msg:Message3)

RETURN friend.id as friendid, msg.id as msgid, p.id as pid
**********
select Message0.content, Message0.creationDate, Person1.firstName, Person1.lastName
from neo4j,Person Person0, Message Message0, Person Person1
where Person0.gender = $param and Person1.birthday > date($param) and neo4j.pid = Person0.id and neo4j.msgid = Message0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person2)-[:KNOWS]->(friend:Person1)-[:LIKES]->(msg:Message3)-[:IS_LOCATED_IN]->(pl:Place)
WHERE p.id = $param
RETURN friend.id as friendid, pl.id as plid, msg.id as msgid
**********
select Message0.content, Person0.firstName, Place0.name, Person0.lastName
from neo4j,Place Place0, Message Message0, Person Person0
where Place0.name = $param and neo4j.plid = Place0.id and neo4j.msgid = Message0.id and neo4j.friendid = Person0.id
##########
MATCH (p:Person2)-[:KNOWS]->(friend:Person2)-[:HAS_INTEREST]->(tag:Tag)-[:HAS_TYPE]->(tagClass:TagClass)
RETURN tagClass.id as tagClassid, friend.id as friendid, tag.id as tagid, p.id as pid
**********
select Person0.lastName, Person1.firstName, Tag0.name, Person0.firstName, TagClass0.name, Person1.lastName
from neo4j,Person Person0, TagClass TagClass0, Tag Tag0, Person Person1
where TagClass0.name = $param and neo4j.friendid = Person0.id and neo4j.tagClassid = TagClass0.id and neo4j.tagid = Tag0.id and neo4j.pid = Person1.id
##########
MATCH (p:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)-[:HAS_CREATOR]->(creator:Person3)
WHERE p.id = $param
RETURN creator.id as creatorid, m.id as mid
**********
select neo4j.mid, Message0.content, Message0.creationDate
from neo4j,Person Person0, Message Message0
where Person0.gender = $param and neo4j.creatorid = Person0.id and neo4j.mid = Message0.id
##########
MATCH (p:Person3)-[:KNOWS*2..4]-(friend:Person3)-[:WORK_AT]->(o:Organisation)-[:IS_LOCATED_IN]->(country:Country)

RETURN friend.id as friendid, o.id as oid, country.id as countryid, p.id as pid
**********
select Organisation0.name, Person1.lastName, Person0.firstName, Person1.firstName, Country0.name, neo4j.countryid, neo4j.friendid, Person0.lastName, neo4j.pid
from neo4j,Organisation Organisation0, Country Country0, Person Person0, Person Person1
where Person0.speaks CONTAINS $param and Country0.name = $param and neo4j.oid = Organisation0.id and neo4j.countryid = Country0.id and neo4j.pid = Person0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person2)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_LOCATED_IN]-(msg:Message3)

RETURN org.id as orgid, place.id as placeid, msg.id as msgid, p.id as pid
**********
select Organisation0.name, Message0.content, Person0.firstName, Place0.name, neo4j.msgid, neo4j.pid
from neo4j,Organisation Organisation0, Message Message0, Person Person0, Place Place0
where Person0.gender = $param and Place0.name = $param and neo4j.orgid = Organisation0.id and neo4j.msgid = Message0.id and neo4j.pid = Person0.id and neo4j.placeid = Place0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(member:Person1)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(post:Post3)

RETURN post.id as postid, f.id as fid
**********
select Post0.creationDate, neo4j.postid, Post0.content
from neo4j,Post Post0, Forum Forum0
where Forum0.title = $param and Post0.creationDate < $param and neo4j.postid = Post0.id and neo4j.fid = Forum0.id
##########
MATCH (f:Forum2)-[:HAS_MEMBER]->(p:Person1)-[:KNOWS]-(friend:Person1)

RETURN friend.id as friendid, p.id as pid, f.id as fid
**********
select neo4j.fid, Person1.lastName, Person1.firstName
from neo4j,Forum Forum0, Person Person0, Person Person1
where Forum0.title = $param and Person0.locationIP = $param and neo4j.fid = Forum0.id and neo4j.friendid = Person0.id and neo4j.pid = Person1.id
##########
MATCH (p1:Person2)-[:KNOWS]->(p2:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)<-[:REPLY_OF]-(c:Comment3)

RETURN m.id as mid, p1.id as p1id, p2.id as p2id, c.id as cid, t.id as tid
**********
select Person0.firstName, Comment0.content, Tag0.name, Message0.content, Person1.firstName
from neo4j,Tag Tag0, Message Message0, Comment Comment0, Person Person0, Person Person1
where Tag0.name = $param and Person1.birthday < $param and neo4j.tid = Tag0.id and neo4j.mid = Message0.id and neo4j.cid = Comment0.id and neo4j.p2id = Person0.id and neo4j.p1id = Person1.id
##########
MATCH (m:Message3)-[:HAS_TAG]->(t:Tag)<-[:HAS_TAG]-(f:Forum1)-[:HAS_MODERATOR]->(mod:Person2)

RETURN mod.id as modid, m.id as mid, t.id as tid
**********
select neo4j.mid, Message0.content, Person0.lastName, Person0.firstName
from neo4j,Tag Tag0, Person Person0, Message Message0
where Tag0.name = $param and Person0.email = $param and neo4j.tid = Tag0.id and neo4j.modid = Person0.id and neo4j.mid = Message0.id
##########
MATCH (p:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(f:Forum2)-[:CONTAINER_OF]->(m:Message3)

RETURN t.id as tid, p.id as pid, f.id as fid, m.id as mid
**********
select Message0.length, Person0.firstName, Tag0.name, Forum0.title, Message0.content, Person0.lastName
from neo4j,Message Message0, Forum Forum0, Person Person0, Tag Tag0
where Person0.email = $param and Message0.length > $param and neo4j.mid = Message0.id and neo4j.fid = Forum0.id and neo4j.pid = Person0.id and neo4j.tid = Tag0.id
##########
MATCH (p:Person3)-[:KNOWS*2..4]-(friend:Person3)

RETURN friend.id as friendid, p.id as pid
**********
select neo4j.friendid, Person1.firstName, Person1.lastName
from neo4j,Person Person0, Person Person1
where Person1.birthday > $param and Person0.firstName = $param and neo4j.pid = Person0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person2)-[:KNOWS]->(friend:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(f:Forum2)

RETURN m.id as mid, creator.id as creatorid, p.id as pid
**********
select Person1.firstName, Person0.firstName, Message0.content, Person0.lastName, Person1.lastName
from neo4j,Person Person0, Person Person1, Message Message0
where Person0.email = $param and Person1.birthday > $param and neo4j.pid = Person0.id and neo4j.creatorid = Person1.id and neo4j.mid = Message0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_LOCATED_IN]-(m:Message3)

RETURN org.id as orgid, place.id as placeid, p.id as pid, m.id as mid
**********
select Organisation0.name, Person0.firstName, Place0.name, Message0.content, Person0.lastName
from neo4j,Person Person0, Message Message0, Organisation Organisation0, Place Place0
where Organisation0.name = $param and Place0.name = $param and neo4j.pid = Person0.id and neo4j.mid = Message0.id and neo4j.orgid = Organisation0.id and neo4j.placeid = Place0.id
##########
MATCH (p:Person2)-[:WORK_AT]->(c:Company)-[:IS_LOCATED_IN]->(country:Country)<-[:IS_LOCATED_IN]-(m:Message3)

RETURN c.id as cid, country.id as countryid, p.id as pid, m.id as mid
**********
select Message0.content, Person0.lastName, Company0.name, Person0.firstName
from neo4j,Country Country0, Company Company0, Person Person0, Message Message0
where Country0.name = $param and Person0.speaks = $param and neo4j.countryid = Country0.id and neo4j.cid = Company0.id and neo4j.pid = Person0.id and neo4j.mid = Message0.id
##########
MATCH (p:Person3)-[:KNOWS*2..3]-(friend:Person3)-[:WORK_AT]->(org:Organisation)

RETURN friend.id as friendid, org.id as orgid, p.id as pid
**********
select neo4j.friendid, Person1.firstName, Person1.lastName
from neo4j,Organisation Organisation0, Person Person0, Person Person1
where Person0.firstName = $param and Organisation0.name = $param and neo4j.orgid = Organisation0.id and neo4j.pid = Person0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person3)-[:KNOWS*2]-(friendOfFriend:Person3)-[:HAS_INTEREST]->(tag:Tag)

RETURN friendOfFriend.id as friendOfFriendid, p.id as pid, tag.id as tagid
**********
select Person0.lastName, Tag0.name, Person0.firstName
from neo4j,Person Person0, Person Person1, Tag Tag0
where Person1.email = $param and Tag0.name = $param and neo4j.friendOfFriendid = Person0.id and neo4j.pid = Person1.id and neo4j.tagid = Tag0.id
MATCH (p:Person2)-[:HAS_INTEREST]->(tag:Tag)-[:HAS_TYPE]->(tagClass:TagClass)<-[:IS_SUBCLASS_OF]-(subTagClass:TagClass)

RETURN subTagClass.id as subTagClassid, p.id as pid, tag.id as tagid
**********
select Person0.firstName, Tag0.name, TagClass0.name, neo4j.pid
from neo4j,Person Person0, Tag Tag0, TagClass TagClass0
where Person0.birthday > $param and neo4j.pid = Person0.id and neo4j.tagid = Tag0.id and neo4j.subTagClassid = TagClass0.id
##########
MATCH (p:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)-[:HAS_CREATOR]->(p2:Person1)

RETURN t.id as tid, m.id as mid, p2.id as p2id, p.id as pid
**********
select Person0.firstName, Person0.lastName, Person1.firstName, neo4j.p2id, Message0.content, Person1.lastName, neo4j.pid
from neo4j,Person Person0, Message Message0, Tag Tag0, Person Person1
where Tag0.name = $param and Person0.birthday > date($param) and neo4j.p2id = Person0.id and neo4j.mid = Message0.id and neo4j.tid = Tag0.id and neo4j.pid = Person1.id
##########
MATCH (p:Person2)-[:KNOWS]->(friend:Person2)-[:HAS_INTEREST]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN friend.id as friendid, tc.id as tcid, p.id as pid
**********
select TagClass0.name, Person1.lastName, Person1.firstName
from neo4j,Person Person0, TagClass TagClass0, Person Person1
where Person0.firstName = $param and neo4j.friendid = Person0.id and neo4j.tcid = TagClass0.id and neo4j.pid = Person1.id
##########
MATCH (org:Organisation)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_LOCATED_IN]-(msg:Message3)

RETURN friend.id as friendid, t.id as tid, tc.id as tcid, p.id as pid
**********
select Person0.firstName, Person1.firstName, Tag0.name, TagClass0.name, neo4j.friendid, neo4j.pid
from neo4j,Tag Tag0, Person Person0, TagClass TagClass0, Person Person1
where Person0.email = $param and TagClass0.name = $param and neo4j.tid = Tag0.id and neo4j.pid = Person0.id and neo4j.tcid = TagClass0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(f:Forum1)-[:HAS_MEMBER]->(p2:Person1)

