MATCH (comment:Comment1)-[:REPLY_OF*]->(message:Message1)-[:HAS_CREATOR]->(creator:Person1)

RETURN creator.id as creatorid, comment.id as commentid
**********
select neo4j.commentid, Person0.lastName, Person0.firstName, Comment0.content
from neo4j,Person Person0, Comment Comment0
where Person0.locationIP = $param and Comment0.creationDate < $param and neo4j.creatorid = Person0.id and neo4j.commentid = Comment0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message1)-[:REPLY_OF]->(c:Comment2)

RETURN m.id as mid, c.id as cid, p.id as pid, t.id as tid
**********
select Message0.content, Person0.lastName, Comment0.content, Person0.firstName
from neo4j,Message Message0, Comment Comment0, Person Person0, Tag Tag0
where Tag0.name = $param and Person0.speaks = $param and neo4j.mid = Message0.id and neo4j.cid = Comment0.id and neo4j.pid = Person0.id and neo4j.tid = Tag0.id
##########
MATCH (f:Forum2)-[:CONTAINER_OF]->(m:Message2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN t.id as tid, tc.id as tcid, f.id as fid, m.id as mid
**********
select Message0.content, Message0.creationDate, Tag0.name
from neo4j,Forum Forum0, TagClass TagClass0, Message Message0, Tag Tag0
where Forum0.title = $param and TagClass0.name = $param and neo4j.fid = Forum0.id and neo4j.tcid = TagClass0.id and neo4j.mid = Message0.id and neo4j.tid = Tag0.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person1)-[:LIKES]->(m:Message1)-[:HAS_CREATOR]->(creator:Person)

RETURN friend.id as friendid, m.id as mid, creator.id as creatorid, p.id as pid
**********
select Person2.firstName, Person1.lastName, Person1.firstName, Message0.content, Person2.lastName
from neo4j,Person Person0, Person Person1, Message Message0, Person Person2
where Person0.birthday < $param and Person1.gender = $param and neo4j.pid = Person0.id and neo4j.friendid = Person1.id and neo4j.mid = Message0.id and neo4j.creatorid = Person2.id
##########
MATCH (c:Comment1)-[:REPLY_OF]->(m:Message1)-[:HAS_CREATOR]->(creator:Person)-[:LIKES]->(c2:Comment2)

RETURN c2.id as c2id, creator.id as creatorid, c.id as cid, m.id as mid
**********
select Message0.content, Person0.lastName, Person0.firstName, Comment1.content
from neo4j,Message Message0, Comment Comment0, Person Person0, Comment Comment1
where Comment0.content CONTAINS $param and Message0.creationDate > $param and neo4j.mid = Message0.id and neo4j.c2id = Comment0.id and neo4j.creatorid = Person0.id and neo4j.cid = Comment1.id
##########
MATCH (forum:Forum)-[:CONTAINER_OF]->(post:Post1)-[:HAS_TAG]->(tag:Tag)

RETURN post.id as postid, forum.id as forumid, tag.id as tagid
**********
select Forum0.creationDate, neo4j.postid, Post0.content
from neo4j,Tag Tag0, Post Post0, Forum Forum0
where Forum0.title = $param and Tag0.name = $param and neo4j.tagid = Tag0.id and neo4j.postid = Post0.id and neo4j.forumid = Forum0.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person1)-[:HAS_INTEREST]->(t:Tag)
RETURN friend.id as friendid, p.id as pid, t.id as tid
**********
select Person0.lastName, Person1.firstName, Person0.firstName, Tag0.name, Person1.lastName
from neo4j,Tag Tag0, Person Person0, Person Person1
where Tag0.name = $param and neo4j.tid = Tag0.id and neo4j.friendid = Person0.id and neo4j.pid = Person1.id
##########
MATCH (c:Comment2)-[:REPLY_OF]->(m:Message1)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)
RETURN m.id as mid, c.id as cid, tc.id as tcid, t.id as tid
**********
select neo4j.cid, Comment0.content, Tag0.name, TagClass0.name, neo4j.mid, Message0.content
from neo4j,Message Message0, Tag Tag0, Comment Comment0, TagClass TagClass0
where TagClass0.name = $param and neo4j.mid = Message0.id and neo4j.tid = Tag0.id and neo4j.cid = Comment0.id and neo4j.tcid = TagClass0.id
##########
MATCH (p:Person1)-[:LIKES]->(m:Message2)-[:HAS_CREATOR]->(creator:Person)-[:WORK_AT]->(o:Organisation)

RETURN o.id as oid, creator.id as creatorid, m.id as mid
**********
select Organisation0.name, Person0.lastName, Person0.firstName
from neo4j,Message Message0, Person Person0, Organisation Organisation0
where Organisation0.name = $param and Message0.creationDate > $param and neo4j.mid = Message0.id and neo4j.creatorid = Person0.id and neo4j.oid = Organisation0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(c:Company)-[:IS_LOCATED_IN]->(pl:Place)<-[:IS_LOCATED_IN]-(o:Organisation)

RETURN o.id as oid, pl.id as plid, c.id as cid, p.id as pid
**********
select Organisation0.name, Company0.name, Person0.firstName
from neo4j,Organisation Organisation0, Place Place0, Person Person0, Company Company0
where Place0.name = $param and Person0.birthday < $param and neo4j.oid = Organisation0.id and neo4j.plid = Place0.id and neo4j.pid = Person0.id and neo4j.cid = Company0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message2)<-[:CONTAINER_OF]-(f:Forum1)

RETURN p.id as pid, f.id as fid, m.id as mid
**********
select Forum0.title, Message0.content, Message0.creationDate
from neo4j,Message Message0, Person Person0, Forum Forum0
where Person0.email = $param and Forum0.creationDate > $param and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person)-[:KNOWS]->(friend:Person1)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(city:City)

RETURN friend.id as friendid, org.id as orgid, p.id as pid, city.id as cityid
**********
select Organisation0.name, City0.name, Person1.lastName, Person0.firstName, Person1.firstName, Person0.lastName
from neo4j,City City0, Organisation Organisation0, Person Person0, Person Person1
where Person0.birthday < $param and City0.name = $param and neo4j.cityid = City0.id and neo4j.orgid = Organisation0.id and neo4j.pid = Person0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person1)-[:HAS_INTEREST]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN friend.id as friendid, tc.id as tcid, p.id as pid, t.id as tid
**********
select Person0.lastName, Person1.firstName, Person0.firstName, Tag0.name, Person1.lastName
from neo4j,Person Person0, Person Person1, Tag Tag0, TagClass TagClass0
where TagClass0.name = $param and Person1.gender = $param and neo4j.friendid = Person0.id and neo4j.pid = Person1.id and neo4j.tid = Tag0.id and neo4j.tcid = TagClass0.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person1)-[:LIKES]->(comment:Comment2)-[:REPLY_OF]->(post:Post1)
WHERE post.title CONTAINS $param
RETURN friend.id as friendid, comment.id as commentid, post.id as postid, p.id as pid
**********
select Person0.lastName, Person1.firstName, neo4j.commentid, Person0.firstName, neo4j.postid, Person1.lastName
from neo4j,Person Person0, Person Person1
where Person1.speaks CONTAINS $param and neo4j.friendid = Person0.id and neo4j.pid = Person1.id
##########
MATCH (org:Organisation)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_LOCATED_IN]-(msg:Message2)-[:HAS_CREATOR]->(p:Person1)

RETURN org.id as orgid, place.id as placeid, msg.id as msgid, p.id as pid
**********
select Organisation0.name, Message0.content, Person0.firstName, Place0.name, Person0.lastName
from neo4j,Place Place0, Person Person0, Message Message0, Organisation Organisation0
where Message0.length > $param and Organisation0.name = $param and neo4j.placeid = Place0.id and neo4j.pid = Person0.id and neo4j.msgid = Message0.id and neo4j.orgid = Organisation0.id
##########
MATCH (tc:TagClass)<-[:HAS_TYPE]-(tag:Tag)<-[:HAS_TAG]-(msg:Message2)-[:REPLY_OF]->(comment:Comment2)

RETURN comment.id as commentid, msg.id as msgid, tc.id as tcid, tag.id as tagid
**********
select Message0.content, TagClass0.name, Tag0.name, Comment0.content
from neo4j,TagClass TagClass0, Tag Tag0, Comment Comment0, Message Message0
where TagClass0.name = $param and Comment0.creationDate < $param and neo4j.tcid = TagClass0.id and neo4j.tagid = Tag0.id and neo4j.commentid = Comment0.id and neo4j.msgid = Message0.id
##########
MATCH (p:Person1)-[:LIKES]->(msg:Message1)<-[:REPLY_OF]-(c:Comment1)-[:HAS_CREATOR]->(creator:Person)

RETURN creator.id as creatorid, msg.id as msgid, c.id as cid, p.id as pid
**********
select Message0.content, Comment0.content, Person1.firstName, Person0.firstName
from neo4j,Message Message0, Person Person0, Person Person1, Comment Comment0
where Person1.gender = $param and Message0.creationDate > date($param) and neo4j.msgid = Message0.id and neo4j.pid = Person0.id and neo4j.creatorid = Person1.id and neo4j.cid = Comment0.id
##########
MATCH (org:Organisation)<-[:WORK_AT]-(p:Person)-[:IS_LOCATED_IN]->(city:City)

RETURN c.id as cid, country.id as countryid, p.id as pid
**********
select Country0.name, Person0.lastName, Company0.name, Person0.firstName
from neo4j,Country Country0, Company Company0, Person Person0
where Country0.name = $param and Person0.gender = $param and neo4j.countryid = Country0.id and neo4j.cid = Company0.id and neo4j.pid = Person0.id
##########
MATCH (f:Forum1)-[:CONTAINER_OF]->(p:Post1)-[:HAS_TAG]->(t:Tag)<-[:HAS_TAG]-(c:Comment1)

RETURN c.id as cid, p.id as pid, m.id as mid
**********
select Person0.firstName, Message0.content, Person0.lastName, Comment0.content
from neo4j,Person Person0, Comment Comment0, Message Message0
where Comment0.creationDate > $param and Person0.browserUsed = $param and neo4j.pid = Person0.id and neo4j.cid = Comment0.id and neo4j.mid = Message0.id
##########
MATCH (p:Person)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message2)<-[:CONTAINER_OF]-(f:Forum)

RETURN m.id as mid, p.id as pid, f.id as fid, t.id as tid
**********
select Forum0.title, Message0.content, Person0.lastName, Person0.firstName
from neo4j,Tag Tag0, Person Person0, Forum Forum0, Message Message0
where Tag0.name = $param and Person0.birthday > $param and neo4j.tid = Tag0.id and neo4j.pid = Person0.id and neo4j.fid = Forum0.id and neo4j.mid = Message0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(p:Person1)-[:LIKES]->(c:Comment1)-[:REPLY_OF]->(m:Message1)<-[:CONTAINER_OF]-(f)

RETURN c.id as cid, p.id as pid, f.id as fid, m.id as mid
**********
select Message0.content, Person0.lastName, Comment0.content, Person0.firstName
from neo4j,Forum Forum0, Message Message0, Comment Comment0, Person Person0
where Forum0.title = $param and Comment0.length > $param and neo4j.fid = Forum0.id and neo4j.mid = Message0.id and neo4j.cid = Comment0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message2)<-[:REPLY_OF]-(c:Comment2)

RETURN t.id as tid, c.id as cid, p.id as pid, m.id as mid
**********
select Comment0.content, Person0.firstName, Tag0.name, Message0.content, Person0.lastName
from neo4j,Tag Tag0, Message Message0, Comment Comment0, Person Person0
where Person0.birthday < $param and Message0.length > $param and neo4j.tid = Tag0.id and neo4j.mid = Message0.id and neo4j.cid = Comment0.id and neo4j.pid = Person0.id
##########
MATCH (p1:Person1)-[:KNOWS]->(p2:Person)-[:WORK_AT]->(o:Organisation)-[:IS_LOCATED_IN]->(c:Country)

RETURN o.id as oid, p1.id as p1id, p2.id as p2id, c.id as cid
**********
select Person0.firstName, Organisation0.name, Person1.lastName, Country0.name, Person0.lastName, Person1.firstName
from neo4j,Person Person0, Country Country0, Person Person1, Organisation Organisation0
where Person1.speaks = $param and Country0.name = $param and neo4j.p2id = Person0.id and neo4j.cid = Country0.id and neo4j.p1id = Person1.id and neo4j.oid = Organisation0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(o:Organisation)-[:IS_LOCATED_IN]->(place:Place)-[:IS_PART_OF]->(country:Country)

RETURN o.id as oid, place.id as placeid, country.id as countryid, p.id as pid
**********
select Organisation0.name, Person0.firstName, Country0.name, Place0.name, Person0.lastName
from neo4j,Country Country0, Organisation Organisation0, Person Person0, Place Place0
where Person0.birthday > $param and Place0.name = $param and neo4j.countryid = Country0.id and neo4j.oid = Organisation0.id and neo4j.pid = Person0.id and neo4j.placeid = Place0.id
##########
MATCH (m:Message2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN t.id as tid, tc.id as tcid, m.id as mid
**********
select TagClass0.name, neo4j.mid, Message0.content, Tag0.name
from neo4j,Tag Tag0, TagClass TagClass0, Message Message0
where TagClass0.name = $param and Message0.creationDate > $param and neo4j.tid = Tag0.id and neo4j.tcid = TagClass0.id and neo4j.mid = Message0.id
##########
MATCH (c1:Comment2)-[:REPLY_OF]->(c2:Comment1)<-[:REPLY_OF]-(c3:Comment1)-[:HAS_TAG]->(t:Tag)

RETURN c2.id as c2id, c1.id as c1id, c3.id as c3id, t.id as tid
**********
select Comment0.content, Comment1.content, Comment2.content, Tag0.name
from neo4j,Comment Comment0, Comment Comment1, Comment Comment2, Tag Tag0
where Comment2.creationDate > $param and Tag0.name = $param and neo4j.c3id = Comment0.id and neo4j.c2id = Comment1.id and neo4j.c1id = Comment2.id and neo4j.tid = Tag0.id
##########
MATCH (c:Country)<-[:IS_LOCATED_IN]-(o:Organisation)<-[:WORK_AT]-(p:Person1)-[:LIKES]->(post:Post2)

RETURN o.id as oid, post.id as postid, c.id as cid, p.id as pid
**********
select Organisation0.name, Country0.name, Person0.lastName, Person0.firstName, Post0.content
from neo4j,Organisation Organisation0, Country Country0, Post Post0, Person Person0
where Country0.name = $param and Post0.browserUsed = $param and neo4j.oid = Organisation0.id and neo4j.cid = Country0.id and neo4j.postid = Post0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(c:City)-[:IS_PART_OF]->(co:Country)

RETURN u.id as uid, c.id as cid, p.id as pid, co.id as coid
**********
select City0.name, Person0.firstName, University0.name, Person0.lastName, Country0.name
from neo4j,Person Person0, Country Country0, City City0, University University0
where Country0.name = $param and Person0.gender = $param and neo4j.pid = Person0.id and neo4j.coid = Country0.id and neo4j.cid = City0.id and neo4j.uid = University0.id
##########
MATCH (p:Post1)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN tc.id as tcid, p.id as pid, t.id as tid
**********
select TagClass0.name, Tag0.name, Post0.content
from neo4j,TagClass TagClass0, Tag Tag0, Post Post0
where Post0.creationDate < $param and TagClass0.name = $param and neo4j.tcid = TagClass0.id and neo4j.tid = Tag0.id and neo4j.pid = Post0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(country:Country)-[:IS_PART_OF]->(continent:Continent)

RETURN org.id as orgid, continent.id as continentid, country.id as countryid, p.id as pid
**********
select Organisation0.name, Country0.name, Person0.firstName
from neo4j,Person Person0, Continent Continent0, Organisation Organisation0, Country Country0
where Continent0.name = $param and Person0.gender = $param and neo4j.pid = Person0.id and neo4j.continentid = Continent0.id and neo4j.orgid = Organisation0.id and neo4j.countryid = Country0.id
##########
MATCH (p:Person1)-[:LIKES]->(m:Message2)-[:HAS_CREATOR]->(creator:Person1)-[:IS_LOCATED_IN]->(place:Place)

RETURN place.id as placeid, creator.id as creatorid, p.id as pid, m.id as mid
**********
select Message0.content, Person0.firstName, Person1.firstName
from neo4j,Person Person0, Place Place0, Person Person1, Message Message0
where Place0.name = $param and neo4j.creatorid = Person0.id and neo4j.placeid = Place0.id and neo4j.pid = Person1.id and neo4j.mid = Message0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message2)

RETURN m.id as mid, p.id as pid, t.id as tid
**********
select Message0.content, Person0.lastName, Person0.firstName
from neo4j,Message Message0, Tag Tag0, Person Person0
where Tag0.name = $param and Person0.gender = $param and neo4j.mid = Message0.id and neo4j.tid = Tag0.id and neo4j.pid = Person0.id
##########
MATCH (f:Forum2)-[:CONTAINER_OF]->(m:Message1)-[:HAS_CREATOR]->(p:Person)

RETURN p.id as pid, f.id as fid, m.id as mid
**********
select Forum0.title, Message0.content, Person0.lastName, Person0.firstName
from neo4j,Message Message0, Person Person0, Forum Forum0
where Forum0.title = $param and Person0.birthday < $param and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.fid = Forum0.id
##########
MATCH (forum:Forum2)-[:HAS_MEMBER]->(member:Person)-[:WORK_AT]->(company:Company)-[:IS_LOCATED_IN]->(place:Place)

RETURN member.id as memberid, forum.id as forumid, company.id as companyid, place.id as placeid
**********
select Forum0.title, Company0.name, Place0.name, Person0.firstName, Person0.lastName
from neo4j,Person Person0, Place Place0, Company Company0, Forum Forum0
where Company0.name = $param and Forum0.creationDate > $param and neo4j.memberid = Person0.id and neo4j.placeid = Place0.id and neo4j.companyid = Company0.id and neo4j.forumid = Forum0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(p:Person)-[:LIKES]->(m:Message2)

RETURN p.id as pid, f.id as fid, m.id as mid
**********
select Forum0.title, Message0.content, Person0.lastName, Person0.firstName
from neo4j,Message Message0, Person Person0, Forum Forum0
where Forum0.creationDate > $param and Message0.length > $param and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message2)-[:IS_LOCATED_IN]->(place:Place)

RETURN t.id as tid, m.id as mid, place.id as placeid, p.id as pid
**********
select Person0.firstName, Place0.name, Tag0.name, neo4j.mid, Message0.content, neo4j.pid
from neo4j,Message Message0, Person Person0, Place Place0, Tag Tag0
where Tag0.name = $param and Place0.name = $param and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.placeid = Place0.id and neo4j.tid = Tag0.id
##########
MATCH (c:Comment1)-[:REPLY_OF*1..2]->(m:Message2)-[:HAS_CREATOR]->(creator:Person)

RETURN creator.id as creatorid, c.id as cid, m.id as mid
**********
select Message0.content, Person0.lastName, Person0.firstName, Comment0.content
from neo4j,Message Message0, Person Person0, Comment Comment0
where Comment0.creationDate > $param and Message0.length > $param and neo4j.mid = Message0.id and neo4j.creatorid = Person0.id and neo4j.cid = Comment0.id
##########
MATCH (p:Person)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message2)<-[:REPLY_OF]-(c:Comment2)

RETURN m.id as mid, c.id as cid, p.id as pid, t.id as tid
**********
select Message0.content, Person0.lastName, Comment0.content, Person0.firstName
from neo4j,Message Message0, Person Person0, Comment Comment0, Tag Tag0
where Tag0.name = $param and Person0.birthday < $param and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.cid = Comment0.id and neo4j.tid = Tag0.id
##########
MATCH (f:Forum2)-[:CONTAINER_OF]->(post:Post2)-[:HAS_CREATOR]->(creator:Person1)<-[:KNOWS]-(friend:Person)

RETURN friend.id as friendid, creator.id as creatorid, post.id as postid, f.id as fid
**********
select Person0.firstName, Person1.lastName, Person1.firstName, Post0.content, Person0.lastName
from neo4j,Person Person0, Forum Forum0, Post Post0, Person Person1
where Forum0.title = $param and Person0.gender = $param and neo4j.creatorid = Person0.id and neo4j.fid = Forum0.id and neo4j.postid = Post0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person)-[:LIKES]->(msg:Message1)-[:HAS_CREATOR]->(creator:Person)-[:WORK_AT]->(c:Company)

RETURN creator.id as creatorid, msg.id as msgid, c.id as cid, p.id as pid
**********
select neo4j.creatorid, Company0.name, Person0.firstName, Message0.content, Person1.firstName, neo4j.msgid, neo4j.pid
from neo4j,Person Person0, Company Company0, Message Message0, Person Person1
where Message0.creationDate > $param and Company0.name = $param and neo4j.creatorid = Person0.id and neo4j.cid = Company0.id and neo4j.msgid = Message0.id and neo4j.pid = Person1.id
##########
MATCH (f:Forum1)-[:CONTAINER_OF]->(m:Message2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN m.id as mid, tc.id as tcid, f.id as fid, t.id as tid
**********
select TagClass0.name, Tag0.name, neo4j.fid, Forum0.title, Message0.content, neo4j.mid
from neo4j,Tag Tag0, TagClass TagClass0, Message Message0, Forum Forum0
where Forum0.title = $param and TagClass0.name = $param and neo4j.tid = Tag0.id and neo4j.tcid = TagClass0.id and neo4j.mid = Message0.id and neo4j.fid = Forum0.id
##########
MATCH (post:Post1)<-[:CONTAINER_OF]-(forum:Forum)-[:HAS_MEMBER]->(member:Person)

RETURN member.id as memberid, forum.id as forumid, post.id as postid
**********
select Forum0.title, Person0.lastName, Post0.content, Person0.firstName
from neo4j,Person Person0, Forum Forum0, Post Post0
where Person0.speaks = $param and Forum0.title = $param and neo4j.memberid = Person0.id and neo4j.forumid = Forum0.id and neo4j.postid = Post0.id
##########
MATCH (p:Person1)-[:STUDY_AT|:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(place:Place)

RETURN org.id as orgid, place.id as placeid, p.id as pid
**********
select Organisation0.name, Person0.lastName, Place0.name, Person0.firstName
from neo4j,Organisation Organisation0, Person Person0, Place Place0
where Person0.birthday < $param and Place0.name = $param and neo4j.orgid = Organisation0.id and neo4j.pid = Person0.id and neo4j.placeid = Place0.id
##########
MATCH (forum:Forum)-[:CONTAINER_OF]->(post:Post2)<-[:REPLY_OF]-(comment:Comment2)-[:HAS_TAG]->(tag:Tag)

RETURN post.id as postid, comment.id as commentid, forum.id as forumid, tag.id as tagid
**********
select Forum0.title, Tag0.name, Post0.content, Comment0.content
from neo4j,Post Post0, Comment Comment0, Tag Tag0, Forum Forum0
where Tag0.name = $param and Forum0.creationDate > $param and neo4j.postid = Post0.id and neo4j.commentid = Comment0.id and neo4j.tagid = Tag0.id and neo4j.forumid = Forum0.id
##########
MATCH (f:Forum2)-[:HAS_MODERATOR]->(mod:Person)-[:LIKES]->(post:Post2)-[:HAS_TAG]->(tag:Tag)

RETURN country.id as countryid, p.id as pid, comp.id as compid
**********
select Country0.name, Person0.lastName, Company0.name, Person0.firstName
from neo4j,Company Company0, Country Country0, Person Person0
where Company0.name = $param and Person0.speaks = $param and neo4j.compid = Company0.id and neo4j.countryid = Country0.id and neo4j.pid = Person0.id
##########
MATCH (c:Comment2)-[:REPLY_OF*2]-(m:Message2)-[:HAS_CREATOR]->(p:Person)

RETURN c.id as cid, p.id as pid, m.id as mid
**********
select Comment0.creationDate, Comment0.content, neo4j.cid
from neo4j,Comment Comment0, Person Person0, Message Message0
where Person0.speaks = $param and Message0.creationDate > $param and neo4j.cid = Comment0.id and neo4j.pid = Person0.id and neo4j.mid = Message0.id
##########
MATCH (m:Message2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)<-[:IS_SUBCLASS_OF]-(tc2:TagClass)

RETURN t.id as tid, tc2.id as tc2id, tc.id as tcid, m.id as mid
**********
select TagClass0.name, Tag0.name, TagClass1.name, neo4j.mid, Message0.content
from neo4j,TagClass TagClass0, Message Message0, TagClass TagClass1, Tag Tag0
where Message0.length < $param and TagClass0.name = $param and neo4j.tc2id = TagClass0.id and neo4j.mid = Message0.id and neo4j.tcid = TagClass1.id and neo4j.tid = Tag0.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person)-[:LIKES]->(m:Message1)-[:HAS_TAG]->(t:Tag)

RETURN t.id as tid, m.id as mid, p.id as pid
**********
select Person0.firstName, Tag0.name, neo4j.mid, Message0.content, Person0.lastName, neo4j.pid
from neo4j,Message Message0, Person Person0, Tag Tag0
where Tag0.name = $param and Person0.firstName = $param and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.tid = Tag0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(u:University)<-[:STUDY_AT]-(friend:Person)-[:KNOWS]-(p)

RETURN friend.id as friendid, org.id as orgid, u.id as uid, p.id as pid, city.id as cityid
**********
select Organisation0.name, City0.name, University0.name
from neo4j,Organisation Organisation0, Person Person0, City City0, University University0, Person Person1
where Person1.birthday < $param and Person0.firstName = $param and neo4j.orgid = Organisation0.id and neo4j.friendid = Person0.id and neo4j.cityid = City0.id and neo4j.uid = University0.id and neo4j.pid = Person1.id
##########
MATCH (msg:Message2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)<-[:IS_SUBCLASS_OF]-(parentTc:TagClass)

RETURN t.id as tid, msg.id as msgid, tc.id as tcid, parentTc.id as parentTcid
**********
select Message0.content, TagClass0.name, neo4j.msgid, Tag0.name
from neo4j,Message Message0, TagClass TagClass0, Tag Tag0, TagClass TagClass1
where TagClass1.name = $param and Message0.locationIP = $param and neo4j.msgid = Message0.id and neo4j.tcid = TagClass0.id and neo4j.tid = Tag0.id and neo4j.parentTcid = TagClass1.id
##########
MATCH (org:Organisation)<-[:WORK_AT]-(p:Person1)-[:KNOWS]-(friend:Person1)-[:LIKES]->(msg:Message1)

RETURN friend.id as friendid, org.id as orgid, msg.id as msgid, p.id as pid
**********
select Message0.content, Person1.lastName, Person0.firstName, Person1.firstName, Person0.lastName
from neo4j,Message Message0, Person Person0, Person Person1, Organisation Organisation0
where Message0.length > $param and Organisation0.name = $param and neo4j.msgid = Message0.id and neo4j.pid = Person0.id and neo4j.friendid = Person1.id and neo4j.orgid = Organisation0.id
##########
MATCH (f:Forum1)-[:HAS_MODERATOR]->(mod:Person)-[:WORK_AT]->(comp:Company)

RETURN mod.id as modid, f.id as fid, comp.id as compid
**********
select Forum0.title, Person0.lastName, Person0.firstName
from neo4j,Forum Forum0, Person Person0, Company Company0
where Forum0.title = $param and Company0.name = $param and neo4j.fid = Forum0.id and neo4j.modid = Person0.id and neo4j.compid = Company0.id
##########
MATCH (person:Person)-[:HAS_CREATOR]-(message:Message2)-[:HAS_TAG]->(tag:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN message.id as messageid, person.id as personid, tc.id as tcid
**********
select Message0.content, Person0.lastName, Person0.firstName
from neo4j,Message Message0, TagClass TagClass0, Person Person0
where TagClass0.name = $param and Message0.length > $param and neo4j.messageid = Message0.id and neo4j.tcid = TagClass0.id and neo4j.personid = Person0.id
##########
MATCH (org:Organisation)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_LOCATED_IN]-(msg:Message1)<-[:CONTAINER_OF]-(forum:Forum2)

RETURN org.id as orgid, place.id as placeid, msg.id as msgid, forum.id as forumid
**********
select Organisation0.name, Forum0.title, Place0.name
from neo4j,Forum Forum0, Organisation Organisation0, Place Place0, Message Message0
where Organisation0.name = $param and Message0.length < $param and neo4j.forumid = Forum0.id and neo4j.orgid = Organisation0.id and neo4j.placeid = Place0.id and neo4j.msgid = Message0.id
##########
MATCH (org:Organisation)-[:IS_LOCATED_IN]->(city:City)-[:IS_PART_OF]->(country:Country)

RETURN org.id as orgid, country.id as countryid, city.id as cityid
**********
select Organisation0.name, City0.name, Country0.name
from neo4j,City City0, Organisation Organisation0, Country Country0
where Organisation0.name = $param and City0.name = $param and neo4j.cityid = City0.id and neo4j.orgid = Organisation0.id and neo4j.countryid = Country0.id
##########
MATCH (c:Comment1)-[:REPLY_OF]->(p:Post2)<-[:CONTAINER_OF]-(f:Forum1)-[:HAS_MEMBER]->(person:Person1)

RETURN person.id as personid, c.id as cid, p.id as pid, f.id as fid
**********
select Forum0.title, Person0.firstName, Post0.content, Comment0.content
from neo4j,Forum Forum0, Person Person0, Comment Comment0, Post Post0
where Forum0.title = $param and Post0.creationDate > datetime($param) and neo4j.fid = Forum0.id and neo4j.personid = Person0.id and neo4j.cid = Comment0.id and neo4j.pid = Post0.id
##########
MATCH (p:Person1)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(place:Place)

RETURN place.id as placeid, u.id as uid, p.id as pid
**********
select University0.name, Place0.name, Person0.firstName
from neo4j,Place Place0, University University0, Person Person0
where Person0.gender = $param and Place0.name = $param and neo4j.placeid = Place0.id and neo4j.uid = University0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person)-[:LIKES]->(msg:Message1)-[:REPLY_OF]->(post:Post1)

RETURN post.id as postid, msg.id as msgid, p.id as pid
**********
select Message0.content, Post0.content, Person0.firstName
from neo4j,Post Post0, Message Message0, Person Person0
where Person0.email CONTAINS $param and Message0.length < $param and neo4j.postid = Post0.id and neo4j.msgid = Message0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person1)-[:KNOWS]->(fof:Person1)

RETURN friend.id as friendid, fof.id as fofid, p.id as pid
**********
select Person1.firstName, Person2.firstName, Person0.firstName
from neo4j,Person Person0, Person Person1, Person Person2
where Person2.gender = $param and Person0.firstName = $param and neo4j.pid = Person0.id and neo4j.friendid = Person1.id and neo4j.fofid = Person2.id
##########
MATCH (u1:University)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(u2:University)

RETURN u1.id as u1id, u2.id as u2id, city.id as cityid
**********
select University1.name, City0.name, University0.name
from neo4j,City City0, University University0, University University1
where University0.name <> u1.name and University1.name = $param and neo4j.cityid = City0.id and neo4j.u2id = University0.id and neo4j.u1id = University1.id
##########
MATCH (p:Person1)-[:LIKES]->(m:Message2)-[:HAS_CREATOR]->(creator:Person)
RETURN m.id as mid, creator.id as creatorid, p.id as pid
**********
select Person1.firstName, Person0.firstName, neo4j.mid, Person0.lastName, Person1.lastName
from neo4j,Person Person0, Person Person1
where Person1.gender = $param and neo4j.pid = Person0.id and neo4j.creatorid = Person1.id
##########
MATCH (f:Forum1)-[:CONTAINER_OF]->(post:Post1)<-[:REPLY_OF]-(comment:Comment1)-[:HAS_CREATOR]->(c:Person1)

RETURN comment.id as commentid, post.id as postid, c.id as cid, f.id as fid
**********
select Person0.firstName, Post0.content, Person0.lastName, Comment0.content
from neo4j,Comment Comment0, Person Person0, Forum Forum0, Post Post0
where Forum0.title = $param and Comment0.creationDate > $param and neo4j.commentid = Comment0.id and neo4j.cid = Person0.id and neo4j.fid = Forum0.id and neo4j.postid = Post0.id
##########
MATCH (p:Person)-[:KNOWS]->(friend:Person1)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(city:City)
RETURN friend.id as friendid, org.id as orgid, p.id as pid, city.id as cityid
**********
select Organisation0.name, City0.name, Person0.lastName, Person1.firstName, Person0.firstName, Person1.lastName
from neo4j,Person Person0, Organisation Organisation0, City City0, Person Person1
where City0.name = $param and neo4j.friendid = Person0.id and neo4j.orgid = Organisation0.id and neo4j.cityid = City0.id and neo4j.pid = Person1.id
##########
MATCH (m:Message1)-[:HAS_CREATOR]->(author:Person1)-[:IS_LOCATED_IN]->(c:City)<-[:IS_LOCATED_IN]-(u:University)

RETURN author.id as authorid, u.id as uid, c.id as cid, m.id as mid
**********
select City0.name, Person0.firstName, University0.name, Person0.lastName, Message0.content
from neo4j,University University0, City City0, Message Message0, Person Person0
where University0.name = $param and Message0.creationDate > $param and neo4j.uid = University0.id and neo4j.cid = City0.id and neo4j.mid = Message0.id and neo4j.authorid = Person0.id
##########
MATCH (f:Forum1)-[:CONTAINER_OF]->(post:Post2)-[:HAS_TAG]->(tag:Tag)<-[:HAS_INTEREST]-(p:Person1)
RETURN tag.id as tagid, post.id as postid, p.id as pid, f.id as fid
**********
select Person0.firstName, Tag0.name, neo4j.postid, Forum0.title, Person0.lastName
from neo4j,Person Person0, Forum Forum0, Tag Tag0
where Person0.gender = $param and neo4j.pid = Person0.id and neo4j.fid = Forum0.id and neo4j.tagid = Tag0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)<-[:IS_SUBCLASS_OF]-(parentTc:TagClass)

