RETURN t.id as tid, p2.id as p2id, p.id as pid, f.id as fid
**********
select Person1.firstName, Person0.firstName, Tag0.name, neo4j.p2id, neo4j.pid
from neo4j,Person Person0, Tag Tag0, Forum Forum0, Person Person1
where Person0.gender = $param and Forum0.title CONTAINS $param and neo4j.pid = Person0.id and neo4j.tid = Tag0.id and neo4j.fid = Forum0.id and neo4j.p2id = Person1.id
##########
MATCH (p:Post3)-[:HAS_TAG]->(t:Tag)<-[:HAS_INTEREST]-(person:Person2)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(city:City)

RETURN person.id as personid, u.id as uid, p.id as pid, city.id as cityid, t.id as tid
**********
select University0.name, Person0.firstName, Person0.lastName, Post0.content
from neo4j,University University0, Post Post0, City City0, Tag Tag0, Person Person0
where Tag0.name = $param and City0.name = $param and neo4j.uid = University0.id and neo4j.pid = Post0.id and neo4j.cityid = City0.id and neo4j.tid = Tag0.id and neo4j.personid = Person0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(c:Company)-[:IS_LOCATED_IN]->(country:Country)<-[:IS_PART_OF]-(city:City)

RETURN country.id as countryid, c.id as cid, p.id as pid, city.id as cityid
**********
select Person0.firstName, City0.name, Country0.name, neo4j.pid
from neo4j,Person Person0, City City0, Country Country0, Company Company0
where Company0.name = $param and City0.name = $param and neo4j.pid = Person0.id and neo4j.cityid = City0.id and neo4j.countryid = Country0.id and neo4j.cid = Company0.id
##########
MATCH (p:Person1)-[:KNOWS]->(:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)

RETURN m.id as mid, p.id as pid, t.id as tid
**********
select Message0.content, Person0.lastName, Message0.creationDate, Person0.firstName
from neo4j,Tag Tag0, Person Person0, Message Message0
where Tag0.name = $param and Message0.creationDate > $param and neo4j.tid = Tag0.id and neo4j.pid = Person0.id and neo4j.mid = Message0.id
##########
MATCH (p:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(f:Forum1)

RETURN m.id as mid, p.id as pid, t.id as tid
**********
select Message0.content, Person0.lastName, Message0.creationDate, Person0.firstName
from neo4j,Tag Tag0, Message Message0, Person Person0
where Person0.locationIP = $param and Tag0.name = $param and neo4j.tid = Tag0.id and neo4j.mid = Message0.id and neo4j.pid = Person0.id
##########
MATCH (forum:Forum1)-[:HAS_MODERATOR]->(moderator:Person1)-[:KNOWS]->(person:Person1)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(msg:Message3)

RETURN moderator.id as moderatorid, tag.id as tagid, person.id as personid, msg.id as msgid, forum.id as forumid
**********
select Message0.content, Forum0.title, Tag0.name, neo4j.forumid, Person0.lastName, Person0.firstName, Person1.firstName, Person1.lastName
from neo4j,Tag Tag0, Forum Forum0, Person Person0, Person Person1, Message Message0
where Message0.creationDate < $param and Person1.locationIP = $param and neo4j.tagid = Tag0.id and neo4j.forumid = Forum0.id and neo4j.personid = Person0.id and neo4j.moderatorid = Person1.id and neo4j.msgid = Message0.id
##########
MATCH (person:Person1)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(msg:Message3)<-[:REPLY_OF]-(comment:Comment3)

RETURN person.id as personid, comment.id as commentid, tag.id as tagid
**********
select Person0.lastName, Person0.firstName, Comment0.content
from neo4j,Person Person0, Comment Comment0, Tag Tag0
where Person0.birthday < $param and Tag0.name = $param and neo4j.personid = Person0.id and neo4j.commentid = Comment0.id and neo4j.tagid = Tag0.id
##########
MATCH (p:Person1)-[:KNOWS]-(f:Person2)-[:HAS_INTEREST]->(t:Tag)

RETURN p.id as pid, f.id as fid, t.id as tid
**********
select Person0.firstName, neo4j.fid, Person0.lastName
from neo4j,Person Person0, Person Person1, Tag Tag0
where Tag0.name = $param and Person1.firstName = $param and neo4j.fid = Person0.id and neo4j.pid = Person1.id and neo4j.tid = Tag0.id
##########
MATCH (p1:Person1)-[:KNOWS]->(p2:Person2)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(forum:Forum1)

RETURN p1.id as p1id, p2.id as p2id, forum.id as forumid, tag.id as tagid
**********
select Person0.firstName, Forum0.title, Tag0.name, neo4j.p2id, Person1.firstName, neo4j.p1id
from neo4j,Person Person0, Person Person1, Tag Tag0, Forum Forum0
where Forum0.title CONTAINS $param and Person1.gender = $param and neo4j.p2id = Person0.id and neo4j.p1id = Person1.id and neo4j.tagid = Tag0.id and neo4j.forumid = Forum0.id
##########
MATCH (msg:Message3)-[:HAS_TAG]->(:Tag)<-[:HAS_TAG]-(related:Message3)

RETURN msg.id as msgid, related.id as relatedid
**********
select Message0.content, Message1.content
from neo4j,Message Message0, Message Message1
where Message1.browserUsed = $param and Message0.locationIP = $param and neo4j.msgid = Message0.id and neo4j.relatedid = Message1.id
##########
MATCH (p:Person1)-[:WORK_AT]->(comp:Company)-[:IS_LOCATED_IN]->(country:Country)<-[:IS_LOCATED_IN]-(msg:Message3)-[:HAS_CREATOR]->(creator:Person3)

RETURN creator.id as creatorid, msg.id as msgid, country.id as countryid
**********
select Message0.content, Person0.lastName, Person0.firstName
from neo4j,Country Country0, Message Message0, Person Person0
where Message0.creationDate < $param and Country0.name = $param and neo4j.countryid = Country0.id and neo4j.msgid = Message0.id and neo4j.creatorid = Person0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)-[:HAS_CREATOR]->(creator:Person3)

RETURN t.id as tid, p.id as pid, f.id as fid, m.id as mid
**********
select neo4j.mid, Person0.firstName, Tag0.name, Forum0.title, Message0.content, Person0.lastName
from neo4j,Tag Tag0, Message Message0, Person Person0, Forum Forum0
where Forum0.title = $param and Message0.creationDate > $param and neo4j.tid = Tag0.id and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person2)-[:KNOWS]->(friend:Person2)-[:WORK_AT]->(c:Company), (friend)-[:HAS_INTEREST]->(t:Tag)
RETURN friend.id as friendid, c.id as cid, p.id as pid, t.id as tid
**********
select Company0.name, Person1.lastName, Person0.firstName, Person1.firstName, Tag0.name, Person0.lastName
from neo4j,Tag Tag0, Company Company0, Person Person0, Person Person1
where Company0.name = $param and neo4j.tid = Tag0.id and neo4j.cid = Company0.id and neo4j.pid = Person0.id and neo4j.friendid = Person1.id
##########
MATCH (post:Post3)-[:HAS_CREATOR]->(creator:Person2)-[:KNOWS]->(friend:Person2)

RETURN friend.id as friendid, creator.id as creatorid, post.id as postid
**********
select Person0.firstName, Person1.lastName, Person1.firstName, neo4j.postid, Person0.lastName
from neo4j,Person Person0, Person Person1, Post Post0
where Post0.creationDate > $param and Person1.speaks = $param and neo4j.creatorid = Person0.id and neo4j.friendid = Person1.id and neo4j.postid = Post0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(member:Person2)-[:LIKES]->(msg:Message3)

RETURN member.id as memberid, msg.id as msgid, f.id as fid
**********
select Message0.content, Forum0.title, Person0.lastName, Person0.firstName
from neo4j,Message Message0, Forum Forum0, Person Person0
where Person0.locationIP = $param and Forum0.creationDate > $param and neo4j.msgid = Message0.id and neo4j.fid = Forum0.id and neo4j.memberid = Person0.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(member:Person1)-[:STUDY_AT]->(uni:University)

RETURN uni.id as uniid, member.id as memberid, f.id as fid
**********
select Person0.lastName, Person0.email, Person0.firstName
from neo4j,Forum Forum0, Person Person0, University University0
where Forum0.title = $param and University0.name = $param and neo4j.fid = Forum0.id and neo4j.memberid = Person0.id and neo4j.uniid = University0.id
##########
MATCH (m:Message3)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)<-[:HAS_TYPE]-(otherTag:Tag)<-[:HAS_TAG]-(otherMessage:Message3)

RETURN t.id as tid, otherMessage.id as otherMessageid, m.id as mid
**********
select neo4j.mid, Message1.content, Tag0.name
from neo4j,Message Message0, Message Message1, Tag Tag0
where Message1.length > $param and Message0.creationDate > $param and neo4j.mid = Message0.id and neo4j.otherMessageid = Message1.id and neo4j.tid = Tag0.id
##########
MATCH (p:Person3)-[:KNOWS*2..3]-(friend:Person3)

RETURN friend.id as friendid, p.id as pid
**********
select Person0.firstName, Person1.lastName, Person0.lastName, Person1.firstName
from neo4j,Person Person0, Person Person1
where Person1.locationIP = $param and Person0.gender = $param and neo4j.friendid = Person0.id and neo4j.pid = Person1.id
##########
MATCH (f:Forum1)-[:HAS_MEMBER]->(p:Person1)-[:HAS_INTEREST]->(t:Tag)

RETURN p.id as pid, f.id as fid, t.id as tid
**********
select Forum0.title, Person0.lastName, Tag0.name, Person0.firstName
from neo4j,Tag Tag0, Forum Forum0, Person Person0
where Forum0.title = $param and Tag0.name = $param and neo4j.tid = Tag0.id and neo4j.fid = Forum0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person2)-[:KNOWS]->(friend:Person2)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(post:Post3)

RETURN p.id as pid, m.id as mid
**********
select neo4j.mid, Message0.content, Message0.creationDate
from neo4j,Person Person0, Message Message0
where Person0.email CONTAINS $param and Message0.creationDate < $param and neo4j.pid = Person0.id and neo4j.mid = Message0.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person1)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(msg:Message3)

RETURN t.id as tid, pl.id as plid, p.id as pid, m.id as mid
**********
select Message0.content, Tag0.name, Person0.firstName
from neo4j,Place Place0, Message Message0, Person Person0, Tag Tag0
where Place0.name = $param and Message0.browserUsed = $param and neo4j.plid = Place0.id and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.tid = Tag0.id
##########
MATCH (p1:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)-[:REPLY_OF]->(original:Post3)

RETURN m.id as mid, p1.id as p1id, original.id as originalid, t.id as tid
**********
select neo4j.originalid, neo4j.mid, Person0.firstName, Person0.lastName
from neo4j,Person Person0, Tag Tag0
where Tag0.name = $param and Person0.locationIP = $param and neo4j.p1id = Person0.id and neo4j.tid = Tag0.id
##########
MATCH (person:Person1)-[:STUDY_AT]->(university:University)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(:Person2)-[:KNOWS]-(friend:Person1)

RETURN university.id as universityid, friend.id as friendid, person.id as personid, city.id as cityid
**********
select City0.name, University0.name, Person0.lastName, Person0.firstName, Person1.lastName, Person1.firstName
from neo4j,Person Person0, Person Person1, University University0, City City0
where University0.name = $param and Person0.gender = $param and neo4j.friendid = Person0.id and neo4j.personid = Person1.id and neo4j.universityid = University0.id and neo4j.cityid = City0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)

RETURN t.id as tid, p.id as pid, m.id as mid
**********
select Person0.firstName, Tag0.name, Message0.content, Message0.length, Person0.lastName
from neo4j,Tag Tag0, Person Person0, Message Message0
where Message0.length > $param and Person0.speaks = $param and neo4j.tid = Tag0.id and neo4j.pid = Person0.id and neo4j.mid = Message0.id
##########
MATCH (p:Person2)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message3)<-[:CONTAINER_OF]-(f:Forum1)

RETURN m.id as mid, p.id as pid, f.id as fid, t.id as tid
**********
select Forum0.title, Message0.content, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Tag Tag0, Message Message0, Forum Forum0
where Tag0.name = $param and Person0.birthday < $param and neo4j.pid = Person0.id and neo4j.tid = Tag0.id and neo4j.mid = Message0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person2)-[:KNOWS]->(friend:Person2)-[:WORK_AT]->(company:Company)-[:IS_LOCATED_IN]->(country:Country)

RETURN friend.id as friendid, p.id as pid
**********
select Person0.email, Person0.firstName, Person0.lastName
from neo4j,Person Person0, Person Person1
where Person1.firstName = $param and Person0.gender = $param and neo4j.friendid = Person0.id and neo4j.pid = Person1.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(tag:Tag)<-[:HAS_TAG]-(msg:Message3)-[:HAS_CREATOR]->(creator:Person3)

RETURN creator.id as creatorid, msg.id as msgid, p.id as pid
**********
select Message0.content, Person0.lastName, Person0.firstName
from neo4j,Message Message0, Person Person0, Person Person1
where Person0.birthday < $param and Person1.gender = $param and neo4j.msgid = Message0.id and neo4j.creatorid = Person0.id and neo4j.pid = Person1.id
##########
MATCH (org:Organisation)<-[:WORK_AT]-(p:Person1)-[:KNOWS]->(friend:Person1)-[:HAS_INTEREST]->(t:Tag)

RETURN friend.id as friendid, org.id as orgid, p.id as pid, t.id as tid
**********
select Person1.lastName, Person0.firstName, Person1.firstName, Tag0.name, Person0.lastName
from neo4j,Tag Tag0, Organisation Organisation0, Person Person0, Person Person1
where Tag0.name = $param and Organisation0.name = $param and neo4j.tid = Tag0.id and neo4j.orgid = Organisation0.id and neo4j.pid = Person0.id and neo4j.friendid = Person1.id