RETURN t.id as tid, tc.id as tcid, p.id as pid, parentTc.id as parentTcid
**********
select Person0.lastName, Tag0.name, TagClass0.name, Person0.firstName
from neo4j,Person Person0, Tag Tag0, TagClass TagClass0, TagClass TagClass1
where TagClass1.name = $param and neo4j.pid = Person0.id and neo4j.tid = Tag0.id and neo4j.parentTcid = TagClass0.id and neo4j.tcid = TagClass1.id
##########
MATCH (t:Tag)<-[:HAS_TAG]-(post:Post2)<-[:REPLY_OF]-(c:Comment1)-[:HAS_CREATOR]->(p:Person)

RETURN post.id as postid, c.id as cid, p.id as pid, t.id as tid
**********
select Person0.firstName, Post0.content, Tag0.name, Comment0.content
from neo4j,Post Post0, Tag Tag0, Comment Comment0, Person Person0
where Tag0.name = $param and Person0.gender = $param and neo4j.postid = Post0.id and neo4j.tid = Tag0.id and neo4j.cid = Comment0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(country:Country)

RETURN org.id as orgid, country.id as countryid, p.id as pid
**********
select Organisation0.name, Country0.name, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Organisation Organisation0, Country Country0
where Organisation0.name = $param and Person0.gender = $param and neo4j.pid = Person0.id and neo4j.orgid = Organisation0.id and neo4j.countryid = Country0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)-[:IS_SUBCLASS_OF]->(tc2:TagClass)

RETURN tc2.id as tc2id, tc.id as tcid, p.id as pid, t.id as tid
**********
select TagClass1.name, Person0.lastName, Tag0.name, Person0.firstName
from neo4j,TagClass TagClass0, Person Person0, TagClass TagClass1, Tag Tag0
where Person0.browserUsed = $param and TagClass0.name = $param and neo4j.tc2id = TagClass0.id and neo4j.pid = Person0.id and neo4j.tcid = TagClass1.id and neo4j.tid = Tag0.id
##########
MATCH (u:University)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_LOCATED_IN]-(org:Organisation)<-[:WORK_AT]-(person:Person)

RETURN person.id as personid, org.id as orgid, place.id as placeid, u.id as uid
**********
select Organisation0.name, University0.name, Place0.name, Person0.firstName
from neo4j,University University0, Place Place0, Organisation Organisation0, Person Person0
where Place0.name = $param and University0.name = $param and neo4j.uid = University0.id and neo4j.placeid = Place0.id and neo4j.orgid = Organisation0.id and neo4j.personid = Person0.id
##########
MATCH (p:Person1)-[:LIKES]->(msg:Message2)-[:HAS_CREATOR]->(creator:Person)

RETURN creator.id as creatorid, msg.id as msgid, p.id as pid
**********
select Message0.content, Person1.lastName, neo4j.msgid, Person1.firstName
from neo4j,Person Person0, Person Person1, Message Message0
where Person0.firstName = $param and Message0.length > $param and neo4j.creatorid = Person0.id and neo4j.pid = Person1.id and neo4j.msgid = Message0.id
##########
MATCH (c:Comment2)-[:REPLY_OF*1..2]->(m:Message2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN tc.id as tcid, c.id as cid, t.id as tid
**********
select Comment0.content, Tag0.name, neo4j.cid
from neo4j,TagClass TagClass0, Tag Tag0, Comment Comment0
where TagClass0.name = $param and Comment0.creationDate > $param and neo4j.tcid = TagClass0.id and neo4j.tid = Tag0.id and neo4j.cid = Comment0.id
##########
MATCH (forum:Forum2)-[:HAS_MEMBER]->(person:Person1)-[:HAS_INTEREST]->(tag:Tag)

RETURN person.id as personid, forum.id as forumid, tag.id as tagid
**********
select Tag0.name, neo4j.forumid, Person0.lastName, Person0.firstName
from neo4j,Tag Tag0, Forum Forum0, Person Person0
where Forum0.title = $param and Tag0.name = $param and neo4j.tagid = Tag0.id and neo4j.forumid = Forum0.id and neo4j.personid = Person0.id
##########
MATCH (person:Person1)-[:KNOWS]->(friend:Person1)-[:WORK_AT]->(company:Company)

RETURN friend.id as friendid, company.id as companyid, person.id as personid
**********
select Person1.lastName, Company0.name, Person1.firstName, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Company Company0, Person Person1
where Person1.browserUsed = $param and Person0.locationIP = $param and neo4j.personid = Person0.id and neo4j.companyid = Company0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person1)-[:IS_LOCATED_IN]->(city:City)-[:IS_PART_OF]->(country:Country)

RETURN country.id as countryid, p.id as pid, city.id as cityid
**********
select Country0.name, Person0.lastName, Person0.firstName
from neo4j,City City0, Person Person0, Country Country0
where Person0.gender = $param and City0.name = $param and neo4j.cityid = City0.id and neo4j.pid = Person0.id and neo4j.countryid = Country0.id
##########
MATCH (post:Post2)-[:HAS_TAG]->(tag:Tag)<-[:HAS_TAG]-(comment:Comment2)-[:REPLY_OF]->(post)

RETURN post.id as postid, comment.id as commentid
**********
select neo4j.postid, neo4j.commentid, Post0.content, Comment0.content
from neo4j,Post Post0, Comment Comment0
where Post0.creationDate < $param and Comment0.length > $param and neo4j.postid = Post0.id and neo4j.commentid = Comment0.id
##########
MATCH (forum:Forum)-[:CONTAINER_OF]->(post:Post1)-[:HAS_CREATOR]->(creator:Person1)

RETURN creator.id as creatorid, post.id as postid, forum.id as forumid
**********
select Forum0.title, neo4j.postid, Person0.lastName, Person0.firstName
from neo4j,Forum Forum0, Person Person0
where Person0.speaks = $param and Forum0.creationDate > $param and neo4j.forumid = Forum0.id and neo4j.creatorid = Person0.id
##########
MATCH (person:Person)-[:WORK_AT]->(company:Company)-[:IS_LOCATED_IN]->(place:Place)
WHERE place.id = $param
RETURN company.id as companyid, person.id as personid, place.id as placeid
**********
select Person0.lastName, Place0.name, Company0.name, Person0.firstName
from neo4j,Place Place0, Person Person0, Company Company0
where Company0.name = $param and neo4j.placeid = Place0.id and neo4j.personid = Person0.id and neo4j.companyid = Company0.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person1)-[:LIKES]->(comment:Comment1)-[:REPLY_OF]->(msg:Message1)-[:HAS_CREATOR]->(author:Person)

RETURN friend.id as friendid, author.id as authorid, comment.id as commentid, msg.id as msgid, p.id as pid
**********
select Message0.content, Person1.lastName, Person0.firstName, Comment0.content, Person2.firstName, Person1.firstName, Person2.lastName, Person0.lastName
from neo4j,Person Person0, Person Person1, Comment Comment0, Person Person2, Message Message0
where Person0.birthday > $param and Person2.gender = $param and neo4j.pid = Person0.id and neo4j.friendid = Person1.id and neo4j.commentid = Comment0.id and neo4j.authorid = Person2.id and neo4j.msgid = Message0.id
##########
MATCH (comment:Comment1)-[:REPLY_OF]->(post:Post2)-[:HAS_CREATOR]->(person:Person)

RETURN person.id as personid, comment.id as commentid, post.id as postid
**********
select Comment0.content, neo4j.commentid, Person0.lastName, Person0.firstName, neo4j.postid
from neo4j,Comment Comment0, Person Person0
where Person0.gender = $param and Comment0.browserUsed = $param and neo4j.commentid = Comment0.id and neo4j.personid = Person0.id
##########
MATCH (f:Forum2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)

RETURN tc.id as tcid, f.id as fid, t.id as tid
**********
select neo4j.fid, Forum0.title, Tag0.name
from neo4j,Forum Forum0, TagClass TagClass0, Tag Tag0
where TagClass0.name = $param and Forum0.creationDate < $param and neo4j.fid = Forum0.id and neo4j.tcid = TagClass0.id and neo4j.tid = Tag0.id
##########
MATCH (f:Forum)-[:HAS_MEMBER]->(p:Person1)-[:LIKES]->(m:Message2)

RETURN p.id as pid, f.id as fid, m.id as mid
**********
select neo4j.mid, Message0.content, Message0.creationDate
from neo4j,Person Person0, Forum Forum0, Message Message0
where Forum0.title = $param and Person0.locationIP = $param and neo4j.pid = Person0.id and neo4j.fid = Forum0.id and neo4j.mid = Message0.id
##########
MATCH (f:Forum2)-[:CONTAINER_OF]->(post:Post2)-[:HAS_TAG]->(tag:Tag)<-[:HAS_INTEREST]-(person:Person1)-[:IS_LOCATED_IN]->(city:City)

RETURN tag.id as tagid, person.id as personid, post.id as postid, f.id as fid, city.id as cityid
**********
select neo4j.postid, Tag0.name, Person0.lastName, Person0.firstName, neo4j.fid, Forum0.title, Post0.content
from neo4j,Tag Tag0, Person Person0, Post Post0, City City0, Forum Forum0
where City0.name = $param and Forum0.title CONTAINS $param and neo4j.tagid = Tag0.id and neo4j.personid = Person0.id and neo4j.postid = Post0.id and neo4j.cityid = City0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person1)-[:KNOWS]->(f:Person)-[:STUDY_AT]->(u:University)

RETURN u.id as uid, p.id as pid, f.id as fid
**********
select Person1.firstName, neo4j.fid, Person1.lastName
from neo4j,University University0, Person Person0, Person Person1
where University0.name = $param and Person0.speaks = $param and neo4j.uid = University0.id and neo4j.pid = Person0.id and neo4j.fid = Person1.id
##########
MATCH (p:Person)-[:WORK_AT]->(c:Company)-[:IS_LOCATED_IN]->(pl:Place)-[:IS_PART_OF]->(co:Country)

RETURN c.id as cid, p.id as pid, co.id as coid
**********
select Person0.firstName, Person0.lastName, Company0.name, neo4j.pid
from neo4j,Country Country0, Company Company0, Person Person0
where Country0.name = $param and Person0.browserUsed = $param and neo4j.coid = Country0.id and neo4j.cid = Company0.id and neo4j.pid = Person0.id
##########
MATCH (m:Message2)-[:HAS_TAG]->(t:Tag)-[:HAS_TYPE]->(tc:TagClass)-[:IS_SUBCLASS_OF*]->(parent:TagClass)

RETURN t.id as tid, tc.id as tcid, parent.id as parentid, m.id as mid
**********
select TagClass1.name, Message0.content, Message0.creationDate, Tag0.name
from neo4j,TagClass TagClass0, Message Message0, Tag Tag0, TagClass TagClass1
where TagClass0.name = $param and Message0.creationDate > $param and neo4j.parentid = TagClass0.id and neo4j.mid = Message0.id and neo4j.tid = Tag0.id and neo4j.tcid = TagClass1.id
##########
MATCH (p:Person)-[:KNOWS]->(friend:Person1)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(pl:Place)

RETURN friend.id as friendid, pl.id as plid, u.id as uid, p.id as pid
**********
select Person1.lastName, Person0.firstName, Person1.firstName, University0.name, Place0.name, Person0.lastName
from neo4j,Person Person0, University University0, Place Place0, Person Person1
where Place0.name = $param and Person1.gender = $param and neo4j.pid = Person0.id and neo4j.uid = University0.id and neo4j.plid = Place0.id and neo4j.friendid = Person1.id
##########
MATCH (p:Person)-[:WORK_AT]->(o:Organisation)-[:IS_LOCATED_IN]->(co:Country)

RETURN o.id as oid, p.id as pid, co.id as coid
**********
select Country0.name, Organisation0.name, Person0.lastName, Person0.firstName
from neo4j,Organisation Organisation0, Country Country0, Person Person0
where Person0.speaks CONTAINS $param and Country0.name = $param and neo4j.oid = Organisation0.id and neo4j.coid = Country0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(c:City)

RETURN u.id as uid, c.id as cid, p.id as pid
**********
select University0.name, Person0.lastName, City0.name, Person0.firstName
from neo4j,Person Person0, University University0, City City0
where Person0.birthday < $param and City0.name = $param and neo4j.pid = Person0.id and neo4j.uid = University0.id and neo4j.cid = City0.id
##########
MATCH (f:Forum1)-[:CONTAINER_OF]->(post:Post1)-[:HAS_CREATOR]->(p:Person1)-[:STUDY_AT]->(u:University)

RETURN post.id as postid, u.id as uid, p.id as pid, f.id as fid
**********
select Person0.lastName, Forum0.title, Post0.content, Person0.firstName
from neo4j,Person Person0, Forum Forum0, University University0, Post Post0
where University0.name = $param and Forum0.title CONTAINS $param and neo4j.pid = Person0.id and neo4j.fid = Forum0.id and neo4j.uid = University0.id and neo4j.postid = Post0.id
##########
MATCH (cmt:Comment1)-[:REPLY_OF]->(msg:Message2)-[:HAS_CREATOR]->(creator:Person)-[:HAS_INTEREST]->(tag:Tag)

RETURN creator.id as creatorid, msg.id as msgid, cmt.id as cmtid, tag.id as tagid
**********
select Person0.firstName, Message0.content, Tag0.name, neo4j.cmtid, Comment0.content, neo4j.msgid, Person0.lastName
from neo4j,Message Message0, Tag Tag0, Person Person0, Comment Comment0
where Person0.locationIP = $param and Comment0.length < $param and neo4j.msgid = Message0.id and neo4j.tagid = Tag0.id and neo4j.creatorid = Person0.id and neo4j.cmtid = Comment0.id
##########
MATCH (post:Post1)-[:HAS_CREATOR]->(p:Person)-[:STUDY_AT]->(uni:University)-[:IS_LOCATED_IN]->(city:City)

RETURN uni.id as uniid, post.id as postid, p.id as pid, city.id as cityid
**********
select City0.name, University0.name, Post0.content, Person0.firstName, neo4j.postid, Person0.lastName
from neo4j,City City0, Post Post0, University University0, Person Person0
where Person0.email = $param and Post0.length > $param and neo4j.cityid = City0.id and neo4j.postid = Post0.id and neo4j.uniid = University0.id and neo4j.pid = Person0.id
##########
MATCH (tag:Tag)-[:HAS_TYPE]->(tc:TagClass)-[:IS_SUBCLASS_OF]->(parentTc:TagClass)

RETURN tc.id as tcid, tag.id as tagid, parentTc.id as parentTcid
**********
select TagClass1.name, neo4j.tagid, Tag0.name, TagClass0.name
from neo4j,TagClass TagClass0, TagClass TagClass1, Tag Tag0
where TagClass1.name = $param and Tag0.name = $param and neo4j.parentTcid = TagClass0.id and neo4j.tcid = TagClass1.id and neo4j.tagid = Tag0.id
##########
MATCH (c:Comment2)-[:REPLY_OF*]->(p:Post2)-[:HAS_CREATOR]->(creator:Person)-[:IS_LOCATED_IN]->(place:Place)

RETURN place.id as placeid, creator.id as creatorid, c.id as cid, p.id as pid
**********
select Person0.firstName, Person0.lastName, Post0.content, Comment0.content
from neo4j,Place Place0, Post Post0, Comment Comment0, Person Person0
where Person0.gender = $param and Place0.name = $param and neo4j.placeid = Place0.id and neo4j.pid = Post0.id and neo4j.cid = Comment0.id and neo4j.creatorid = Person0.id
##########
MATCH (org:Organisation)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(univ:University)<-[:STUDY_AT]-(p:Person1)

RETURN org.id as orgid, univ.id as univid, p.id as pid, city.id as cityid
**********
select Organisation0.name, University0.name, Person0.lastName, Person0.firstName
from neo4j,Organisation Organisation0, University University0, City City0, Person Person0
where Organisation0.name = $param and City0.name = $param and neo4j.orgid = Organisation0.id and neo4j.univid = University0.id and neo4j.cityid = City0.id and neo4j.pid = Person0.id
##########
MATCH (f:Forum)-[:CONTAINER_OF]->(p:Post2)-[:HAS_TAG]->(t:Tag)<-[:HAS_INTEREST]-(person:Person1)-[:KNOWS]->(p2:Person1)

RETURN t.id as tid, tc2.id as tc2id, tc.id as tcid, m.id as mid
**********
select TagClass0.name, Message0.content, Tag0.name, TagClass1.name
from neo4j,TagClass TagClass0, TagClass TagClass1, Tag Tag0, Message Message0
where TagClass1.name = $param and Message0.length > $param and neo4j.tcid = TagClass0.id and neo4j.tc2id = TagClass1.id and neo4j.tid = Tag0.id and neo4j.mid = Message0.id
##########
MATCH (tc:TagClass)<-[:HAS_TYPE]-(t:Tag)<-[:HAS_TAG]-(post:Post2)<-[:CONTAINER_OF]-(f:Forum)

RETURN post.id as postid, tc.id as tcid, f.id as fid, t.id as tid
**********
select Forum0.title, Post0.content, Tag0.name
from neo4j,Forum Forum0, Tag Tag0, Post Post0, TagClass TagClass0
where TagClass0.name = $param and Forum0.creationDate < $param and neo4j.fid = Forum0.id and neo4j.tid = Tag0.id and neo4j.postid = Post0.id and neo4j.tcid = TagClass0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(msg:Message2)-[:IS_LOCATED_IN]->(place:Place)

RETURN place.id as placeid, msg.id as msgid, p.id as pid, t.id as tid
**********
select Message0.content, Message0.creationDate, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Place Place0, Message Message0, Tag Tag0
where Tag0.name = $param and Place0.name = $param and neo4j.pid = Person0.id and neo4j.placeid = Place0.id and neo4j.msgid = Message0.id and neo4j.tid = Tag0.id
##########
MATCH (c:City)<-[:IS_LOCATED_IN]-(u:University)<-[:STUDY_AT]-(p:Person)-[:HAS_INTEREST]->(t:Tag)

RETURN u.id as uid, c.id as cid, p.id as pid, t.id as tid
**********
select University0.name, Person0.lastName, City0.name, Person0.firstName
from neo4j,Tag Tag0, Person Person0, University University0, City City0
where Tag0.name = $param and City0.name = $param and neo4j.tid = Tag0.id and neo4j.pid = Person0.id and neo4j.uid = University0.id and neo4j.cid = City0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message1)-[:REPLY_OF]->(c:Comment2)-[:HAS_CREATOR]->(p2:Person)

RETURN m.id as mid, c.id as cid, p2.id as p2id, p.id as pid, t.id as tid
**********
select Person0.firstName, Person0.lastName, Person1.firstName, Comment0.content, Message0.content, Person1.lastName
from neo4j,Message Message0, Person Person0, Comment Comment0, Person Person1, Tag Tag0
where Person0.gender = $param and Tag0.name = $param and neo4j.mid = Message0.id and neo4j.p2id = Person0.id and neo4j.cid = Comment0.id and neo4j.pid = Person1.id and neo4j.tid = Tag0.id
##########
MATCH (person:Person1)-[:STUDY_AT]->(university:University)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_LOCATED_IN]-(message:Message2)

RETURN message.id as messageid, university.id as universityid, person.id as personid
**********
select Message0.content, Person0.lastName, University0.name, Person0.firstName
from neo4j,Message Message0, Person Person0, University University0
where University0.name = $param and Message0.creationDate < datetime($param) and neo4j.messageid = Message0.id and neo4j.personid = Person0.id and neo4j.universityid = University0.id
##########
MATCH (f:Forum)-[:CONTAINER_OF]->(p:Post1)-[:HAS_CREATOR]->(creator:Person1)-[:HAS_INTEREST]->(tag:Tag)

RETURN tag.id as tagid, creator.id as creatorid, p.id as pid, f.id as fid
**********
select Person0.email, Forum0.title, Tag0.name, neo4j.pid
from neo4j,Person Person0, Tag Tag0, Forum Forum0
where Forum0.title = $param and Person0.locationIP = $param and neo4j.creatorid = Person0.id and neo4j.tagid = Tag0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message2)<-[:CONTAINER_OF]-(f:Forum2)-[:HAS_MODERATOR]->(mod:Person)

RETURN mod.id as modid, m.id as mid, p.id as pid, t.id as tid
**********
select Person1.lastName, Message0.content, Tag0.name, Person0.firstName
from neo4j,Person Person0, Message Message0, Tag Tag0, Person Person1
where Tag0.name = $param and Person0.gender = $param and neo4j.pid = Person0.id and neo4j.mid = Message0.id and neo4j.tid = Tag0.id and neo4j.modid = Person1.id
##########
MATCH (u:University)<-[:STUDY_AT]-(p:Person1)-[:KNOWS]->(friend:Person)-[:WORK_AT]->(c:Company)

RETURN friend.id as friendid, u.id as uid, c.id as cid, p.id as pid
**********
select University0.name, Person1.lastName, Company0.name, Person0.firstName
from neo4j,Person Person0, University University0, Company Company0, Person Person1
where Person1.birthday > $param and University0.name = $param and neo4j.pid = Person0.id and neo4j.uid = University0.id and neo4j.cid = Company0.id and neo4j.friendid = Person1.id
##########
MATCH (comment:Comment1)-[:REPLY_OF]->(post:Post1)-[:HAS_CREATOR]->(creator:Person1)-[:LIKES]->(likedPost:Post2)
WHERE likedPost.id = $param
RETURN creator.id as creatorid, post.id as postid, comment.id as commentid
**********
select Post0.content, Person0.lastName, Person0.firstName, Comment0.content
from neo4j,Post Post0, Comment Comment0, Person Person0
where Person0.birthday > date($param) and neo4j.postid = Post0.id and neo4j.commentid = Comment0.id and neo4j.creatorid = Person0.id
##########
MATCH (forum:Forum2)-[:HAS_MEMBER]->(person:Person1)-[:HAS_INTEREST]->(tag:Tag)-[:HAS_TYPE]->(tagClass:TagClass)

RETURN tagClass.id as tagClassid, person.id as personid, forum.id as forumid, tag.id as tagid
**********
select Forum0.title, Tag0.name, Person0.lastName, Person0.firstName
from neo4j,Tag Tag0, Forum Forum0, TagClass TagClass0, Person Person0
where TagClass0.name = $param and Forum0.creationDate < datetime($param) and neo4j.tagid = Tag0.id and neo4j.forumid = Forum0.id and neo4j.tagClassid = TagClass0.id and neo4j.personid = Person0.id
##########
MATCH (c:Comment2)-[:REPLY_OF*2]->(originalPost:Post2)-[:HAS_CREATOR]->(creator:Person1)

RETURN creator.id as creatorid, c.id as cid, originalPost.title as originalPosttitle
**********
select neo4j.originalPosttitle, Person0.firstName, neo4j.cid
from neo4j,Comment Comment0, Person Person0
where Comment0.creationDate > $param and Person0.speaks CONTAINS $param and neo4j.cid = Comment0.id and neo4j.creatorid = Person0.id
##########
MATCH (f:Forum2)-[:HAS_MEMBER]->(p:Person)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(c:City)

RETURN u.id as uid, c.id as cid, p.id as pid, f.id as fid
**********
select City0.name, Person0.firstName, University0.name, Forum0.title, Person0.lastName
from neo4j,Forum Forum0, City City0, University University0, Person Person0
where City0.name = $param and Forum0.creationDate > datetime($param) and neo4j.fid = Forum0.id and neo4j.cid = City0.id and neo4j.uid = University0.id and neo4j.pid = Person0.id
##########
MATCH (c:Comment1)-[:REPLY_OF*]->(origPost:Post2)<-[:CONTAINER_OF]-(f:Forum)

RETURN c.id as cid, f.id as fid
**********
select Comment0.creationDate, Comment0.content
from neo4j,Comment Comment0, Forum Forum0
where Forum0.title = $param and neo4j.cid = Comment0.id and neo4j.fid = Forum0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(co:Company)-[:IS_LOCATED_IN]->(c:Country)

RETURN c.id as cid, p.id as pid, co.id as coid
**********
select Company0.name, Person0.lastName, Country0.name, Person0.firstName
from neo4j,Person Person0, Country Country0, Company Company0
where Country0.name = $param and Person0.gender = $param and neo4j.pid = Person0.id and neo4j.cid = Country0.id and neo4j.coid = Company0.id
##########
MATCH (p:Person)-[:LIKES]->(msg:Message2)-[:REPLY_OF]->(post:Post1)-[:HAS_TAG]->(t:Tag)

RETURN post.id as postid, msg.id as msgid, p.id as pid, t.id as tid
**********
select Message0.content, Post0.content, Person0.lastName, Person0.firstName
from neo4j,Person Person0, Post Post0, Tag Tag0, Message Message0
where Tag0.name = $param and Message0.creationDate < datetime($param) and neo4j.pid = Person0.id and neo4j.postid = Post0.id and neo4j.tid = Tag0.id and neo4j.msgid = Message0.id
##########
MATCH (msg:Message1)-[:HAS_TAG]->(tag:Tag)<-[:HAS_TAG]-(relatedMsg:Message2)

RETURN relatedMsg.id as relatedMsgid, msg.id as msgid
**********
select Message0.content, Message1.content
from neo4j,Message Message0, Message Message1
where Message0.creationDate > $param and neo4j.msgid = Message0.id and neo4j.relatedMsgid = Message1.id
##########
MATCH (p:Person1)-[:WORK_AT]->(org:Organisation)-[:IS_LOCATED_IN]->(city:City)

RETURN org.id as orgid, p.id as pid, city.id as cityid
**********
select Organisation0.name, City0.name, Person0.lastName, Person0.firstName
from neo4j,Organisation Organisation0, Person Person0, City City0
where Organisation0.name = $param and City0.name = $param and neo4j.orgid = Organisation0.id and neo4j.pid = Person0.id and neo4j.cityid = City0.id
##########
MATCH (p:Person)-[:KNOWS]->(friend:Person)-[:LIKES]->(c:Comment1)
WHERE p.id = $param
RETURN friend.id as friendid, c.id as cid, p.id as pid
**********
select Person0.lastName, Comment0.content, Person1.firstName, Person0.firstName, Person1.lastName
from neo4j,Person Person0, Comment Comment0, Person Person1
where Comment0.creationDate > datetime($param) and neo4j.friendid = Person0.id and neo4j.cid = Comment0.id and neo4j.pid = Person1.id
##########
MATCH (m:Message2)<-[:REPLY_OF]-(c:Comment1)-[:HAS_CREATOR]->(p:Person)-[:LIKES]->(post:Post1)-[:HAS_TAG]->(t:Tag)

RETURN t.id as tid, m.id as mid, post.id as postid, c.id as cid, p.id as pid
**********
select neo4j.pid, neo4j.mid, neo4j.tid, neo4j.cid, neo4j.postid
from neo4j,Tag Tag0, Message Message0
where Tag0.name = $param and Message0.browserUsed = $param and neo4j.tid = Tag0.id and neo4j.mid = Message0.id
##########
MATCH (p:Person)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(m:Message2)-[:REPLY_OF]->(c:Comment2)-[:HAS_CREATOR]->(person:Person)

RETURN t.id as tid, person.id as personid, p.id as pid, m.id as mid
**********
select Person0.firstName, Person1.lastName, Tag0.name, Person1.firstName, Message0.content, Person0.lastName
from neo4j,Message Message0, Person Person0, Person Person1, Tag Tag0
where Person1.birthday < $param and Message0.creationDate > $param and neo4j.mid = Message0.id and neo4j.pid = Person0.id and neo4j.personid = Person1.id and neo4j.tid = Tag0.id
##########
MATCH (f:Forum1)-[:CONTAINER_OF]->(post:Post2)-[:HAS_CREATOR]->(p:Person)-[:STUDY_AT]->(u:University)-[:IS_LOCATED_IN]->(c:City)

RETURN post.id as postid, u.id as uid, c.id as cid, p.id as pid, f.id as fid
**********
select City0.name, Post0.content, Person0.firstName, University0.name, Forum0.title, Person0.lastName
from neo4j,City City0, Forum Forum0, Post Post0, Person Person0, University University0
where City0.name = $param and Forum0.title CONTAINS $param and neo4j.cid = City0.id and neo4j.fid = Forum0.id and neo4j.postid = Post0.id and neo4j.pid = Person0.id and neo4j.uid = University0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(comp:Company)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_PART_OF]-(country:Country)

RETURN place.id as placeid, country.id as countryid, p.id as pid, comp.id as compid
**********
select neo4j.countryid, neo4j.placeid, neo4j.compid, neo4j.pid
from neo4j,Country Country0, Person Person0
where Country0.name = $param and Person0.speaks = $param and neo4j.countryid = Country0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(o:Organisation)-[:IS_LOCATED_IN]->(city:City)<-[:IS_LOCATED_IN]-(univ:University)<-[:STUDY_AT]-(student:Person1)

RETURN student.id as studentid, o.id as oid, univ.id as univid, p.id as pid, city.id as cityid
**********
select City0.name, University0.name, Organisation0.name, Person0.lastName, Person0.firstName, Person1.firstName, Person1.lastName
from neo4j,Organisation Organisation0, City City0, Person Person0, Person Person1, University University0
where Person0.gender = $param and Organisation0.name = $param and neo4j.oid = Organisation0.id and neo4j.cityid = City0.id and neo4j.studentid = Person0.id and neo4j.pid = Person1.id and neo4j.univid = University0.id
##########
MATCH (p:Person1)-[:KNOWS]->(friend:Person)-[:LIKES]->(post:Post2)

RETURN friend.id as friendid, post.id as postid, p.id as pid
**********
select Person1.lastName, Person0.lastName, Person1.firstName, Person0.firstName, Post0.content
from neo4j,Person Person0, Person Person1, Post Post0
where Post0.creationDate > $param and neo4j.friendid = Person0.id and neo4j.pid = Person1.id and neo4j.postid = Post0.id
##########
MATCH (forum:Forum)-[:HAS_MODERATOR]->(moderator:Person1)-[:LIKES]->(post:Post2)-[:HAS_CREATOR]->(creator:Person)-[:HAS_INTEREST]->(tag:Tag)

RETURN moderator.id as moderatorid, creator.id as creatorid, post.id as postid, tag.id as tagid
**********
select Person1.email, Post0.content, Person1.firstName
from neo4j,Person Person0, Person Person1, Post Post0, Tag Tag0
where Person0.gender = $param and Tag0.name = $param and neo4j.moderatorid = Person0.id and neo4j.creatorid = Person1.id and neo4j.postid = Post0.id and neo4j.tagid = Tag0.id
##########
MATCH (f:Forum2)-[:CONTAINER_OF]->(m:Message2)-[:HAS_CREATOR]->(p:Person1)

RETURN c.id as cid, p.id as pid, m.id as mid
**********
select Person0.firstName, Message0.content, Person0.lastName, Comment0.content
from neo4j,Person Person0, Comment Comment0, Message Message0
where Comment0.creationDate > $param and neo4j.pid = Person0.id and neo4j.cid = Comment0.id and neo4j.mid = Message0.id
##########
MATCH (c:Comment1)-[:REPLY_OF]->(m:Message1)-[:HAS_CREATOR]->(p:Person)-[:IS_LOCATED_IN]->(place:City)

RETURN c.id as cid, country.id as countryid, p.id as pid
**********
select Country0.name, Person0.lastName, Company0.name, Person0.firstName
from neo4j,Company Company0, Person Person0, Country Country0
where Person0.birthday < $param and Country0.name = $param and neo4j.cid = Company0.id and neo4j.pid = Person0.id and neo4j.countryid = Country0.id
##########
MATCH (p:Person1)-[:WORK_AT]->(comp:Company)-[:IS_LOCATED_IN]->(c:Country)

RETURN c.id as cid, p.id as pid, comp.id as compid
**********
select Person0.lastName, Company0.name, Country0.name, Person0.firstName
from neo4j,Person Person0, Company Company0, Country Country0
where Person0.gender = $param and Country0.name = $param and neo4j.pid = Person0.id and neo4j.compid = Company0.id and neo4j.cid = Country0.id
##########
MATCH (cmt:Comment1)-[:REPLY_OF]->(post:Post1)-[:HAS_CREATOR]->(p:Person)-[:IS_LOCATED_IN]->(place:Place)

RETURN place.id as placeid, post.id as postid, cmt.id as cmtid, p.id as pid
**********
select Post0.content, Comment0.content, Place0.name, Person0.firstName
from neo4j,Comment Comment0, Post Post0, Place Place0, Person Person0
where Comment0.length < $param and Place0.name = $param and neo4j.cmtid = Comment0.id and neo4j.postid = Post0.id and neo4j.placeid = Place0.id and neo4j.pid = Person0.id
##########
MATCH (p:Person1)-[:HAS_INTEREST]->(t:Tag)<-[:HAS_TAG]-(f:Forum2)-[:CONTAINER_OF]->(post:Post1)

RETURN post.id as postid, p.id as pid, f.id as fid, t.id as tid
**********
select Forum0.title, Post0.content, Person0.firstName
from neo4j,Person Person0, Tag Tag0, Forum Forum0, Post Post0
where Tag0.name = $param and Post0.creationDate > datetime($param) and neo4j.pid = Person0.id and neo4j.tid = Tag0.id and neo4j.fid = Forum0.id and neo4j.postid = Post0.id
##########
MATCH (cmt:Comment1)-[:REPLY_OF]->(msg:Message2)-[:HAS_CREATOR]->(creator:Person)

RETURN creator.id as creatorid, msg.id as msgid, cmt.id as cmtid
**********
select neo4j.creatorid, Person0.firstName, Message0.content, neo4j.cmtid, Comment0.content, neo4j.msgid, Person0.lastName
from neo4j,Person Person0, Comment Comment0, Message Message0
where Person0.locationIP = $param and Comment0.creationDate < $param and neo4j.creatorid = Person0.id and neo4j.cmtid = Comment0.id and neo4j.msgid = Message0.id
##########
MATCH (p:Person)-[:STUDY_AT]->(uni:University)-[:IS_LOCATED_IN]->(place:Place)<-[:IS_LOCATED_IN]-(msg:Message1)<-[:REPLY_OF]-(cmt:Comment1)

RETURN uni.id as uniid, place.id as placeid, msg.id as msgid, cmt.id as cmtid, p.id as pid
**********
select University0.name, Message0.content, Person0.firstName, Comment0.content, neo4j.pid
from neo4j,Place Place0, Message Message0, University University0, Person Person0, Comment Comment0
where Person0.birthday < $param and Place0.name = $param and neo4j.placeid = Place0.id and neo4j.msgid = Message0.id and neo4j.uniid = University0.id and neo4j.pid = Person0.id and neo4j.cmtid = Comment0.id
##########
MATCH (msg:Message1)-[:REPLY_OF]->(post:Post1)-[:HAS_CREATOR]->(creator:Person)-[:WORK_AT]->(comp:Company)

RETURN creator.id as creatorid, post.id as postid, msg.id as msgid, comp.id as compid
**********
select Person0.firstName, Message0.content, neo4j.msgid, neo4j.postid, Company0.name
from neo4j,Company Company0, Message Message0, Person Person0
where Company0.name = $param and Message0.locationIP = $param and neo4j.compid = Company0.id and neo4j.msgid = Message0.id and neo4j.creatorid = Person0.id
##########
MATCH (p:Person1)-[:LIKES]->(msg:Message1)-[:HAS_TAG]->(t:Tag)

RETURN msg.id as msgid, p.id as pid, t.id as tid
**********
select Message0.content, Person0.lastName, Tag0.name, Person0.firstName
from neo4j,Person Person0, Message Message0, Tag Tag0
where Tag0.name = $param and Message0.creationDate > datetime($param) and neo4j.pid = Person0.id and neo4j.msgid = Message0.id and neo4j.tid = Tag0.id
##########
MATCH (tag:Tag)<-[:HAS_TAG]-(comment:Comment2)-[:REPLY_OF]->(msg:Message1)-[:HAS_TAG]->(relatedTag:Tag)

